{"id":"72ygbt0dvf9","title":"ZombieProm","content":"MISS STRICT: Well, well, well, what have we here, Johnny Come-Lately?\n\n>JONNY: No. Jonny Warner.\n\nMISS STRICT: Oh yes, our new transfer student. Kicked out of every other school in town.\n\n>JONNY: That’s right.\n\nMISS STRICT: For truancy...\n\n>JONNY: I get sick a lot.\n\nMISS STRICT: Delinquency...\n\n>JONNY: I was framed.\n\nMISS STRICT: And an all around bad attitude.\n\n>JONNY: Yeah, I guess I didn’t fit in.\n\nMISS STRICT: You ward-of-the-state boys rarely do.\n\n>JONNY: Whatever you say, Teach.\n\nMISS STRICT: Mr. Warner, I couldn’t help noticing the name on your jacket is missing a letter.\n\n>JONNY: I know. That’s how I’m spelling it now: “Jon without an H Warner”.\n\nMISS STRICT: Do you really think that’s wise? Defiling a good Christian name like that? No, no. Change it back, Johnny.\n\n>JONNY: I think I want to keep the “H” out.\n\nTOFFEE: Homecoming Dance coming up, Jonny.\n\n>JONNY: I don't know, Toffee. I've never been to a dance before. I wouldn't know how.\n\nTOFFEE:   (to JONNY) And I know we said we wouldn't exchange gifts...but I want you to have this. (SHE holds out a small, wrapped package to JONNY. An \"ID\" bracelet.)\n\n>JONNY: You shouldn't have. (SHE looks disappointed) But I'm glad you did. 'Cause I want you to have this. (Taking off HIS \"No H\" jacket and holding it out to HER.) Go on. Take it. (SHE throws the present to HIM, grabs the jacket and walks away dreamily.)\n\nTOFFEE: Jonny! It's your \"No H\" jacket! (Beat) Are you asking me to go steady?\n\n>JONNY: I'm not good with speeches, Toffee. I grew up an orphan. I didn't have all the things the other kids had. No mom, no dad...no fancy birthday parties with ice cream and cake....\n\nTOFFEE: Oh, Jonny...\n\n>JONNY: I was always getting shipped around from foster home to foster home. Never stayed with anyone for more than a couple months.\n\nTOFFEE:   (as JONNY opens his package) Merry Christmas.\n\n>JONNY: You're the first person who's ever loved me. It would kill me to think this wasn't forever.\n\nMOTHER/FATHER/MISS STRICT:   (Fading into the distance) Break up with him!!!! Break up with him!!!! Break up with him!!! Break up with him!!!! Break up with him!!!! Break up with him!!! Break up with him!!!! Break up with him!!!! Break up with him!!! Break up with him!!!! Break up with him!!!! Break up with him!!!\n\n>JONNY:   (Entering, overlapping final cacophony) Break up? What are you talking about!!??\n\nTOFFEE: My parents won't let me see you any more, Jonny...\n\n>JONNY: But...but you said you loved me.\n\nTOFFEE: I do, Jonny, but...\n\n>JONNY: You said we were forever. But I guess that was a lie. You never loved me.\n\nTOFFEE: Jonny, that's not true....\n\n>JONNY: You're just like everyone else in my life.\n\nTOFFEE: Don't say that, Jonny...\n\n>JONNY: There ain't no goin' back. That's what we always said. No goin' back. How can you? How can you?!!!\n\n### After Blast From the Past\n\n>JONNY: Toffee!\n\n## Scene 3\n\n>JONNY: Toffee! Please, wait! (She stops and turns around.) Is there a problem?\n\nTOFFEE: How did you get back here?\n\n>JONNY: Toffee, you gotta know. It was you.\n\nTOFFEE: Me? I did this?\n\n>JONNY: It was always you.\n\nTOFFEE: Oh, but Jonny, we can't just go back to what we had before.\n\n>JONNY: What do you mean?\n\nMISS STRICT: Good day, Mr. Warner! Case closed!\n\n>JONNY: I was really counting on graduating.\n\nJOEY: Hey, Jonny. Don't take it so hard.\n\n>JONNY: You guys don't get it. Who's gonna hire a zombie without a high school diploma?\n\nJAKE: It's not all that bad, Jonny. Who cares what Miss Strict says? You still got ol' Jake!\n\nJOEY: And Joey!\n\n>JONNY: And you, Toffee? I've still got you, right? Toffee?\n\nTOFFEE:   (Fumbling and nervous) I...I...I'm going to be late. I've got Gym and Chemistry and... Well, it was nice seeing you again, Jonny. (With a weak smile) You look good.\n\n>JONNY:   (Grabbing HER by the hand, spilling most of the chemistry junk) Chemistry! What about our chemistry?\n\nCOCO: You are such a jockstrap.\n\n>JONNY: Toffee? Talk to me, Toffee...\n\n### During Where Do We Go From Here\n\n>JONNY: You loved me once, Toffee. It seems like a lifetime ago.\n\nTOFFEE: It was a lifetime ago.\n\n>JONNY: Still, I won't believe that anything's changed.\n\nTOFFEE: Oh Jonny, my parents didn't approve of you when you were alive. I can't believe they're gonna change their minds now that you're dead. And what about Miss Strict?\n\n>JONNY: I'm going to the Senior Prom, Toffee. I want you there with me. You're my girl.\n\nTOFFEE:   (running out in one direction) Oh, I can't. I'm sorry, Jonny, I just can't.\n\n>JONNY: Toffee.....??\n\n### Scene 5\n\nEDDIE: This is it, kid...the big time, kid. National television. Just think, Jonny. Tomorrow, that oozing mug of yours is gonna be known from coast to ever-lovin' coast. No more being kicked around just because you kicked the bucket.\n\nSTAGE MANAGER: Clear!\n\n>JONNY: I really want to thank you, Mr. Flagrante.\n\nEDDIE: Oh, but you...you took matters into your own hands. Like taking the H out of your name – now that was a smart ove. I often wonderf what my life would have been like if I had taken one of the “D’s” out of mine. 'Course, my name would have been Edie, then. Probably a good idea that I didn’t... (More peole enter and mill about, a MAKE-UP WOMAN, an ANNOUNCER, two SINGERs dressed in green and blue gas station attendant unifroms, a GIRL SINGER I a flamboyant, Latin costume, also blue and green.)\n\n>JONNY: It’s just that no one's ever stood behind me like this before.\n\nSTAGE MANAGER: Clear!\n\nEDDIE: Yeah, I heard. Orphan, huh?\n\n>JONNY: Yeah.\n\nEDDIE:  \nJONNY WARNER, AGE EIGHTEEN,   \nTELL US OF THIS AGE OLD SCENE   \nBOY MEETS GIRL   \nBOY GETS DUMPED   \nBOY THEN TAKES A HEADLONG DIVE\n\n>JONNY: Actually it was more of a cannonball...\n\nEDDIE:   \nSO YOU SAY YOUR GIRL'S IN A STEW, JONNY BOY   \nPUT OFF BY YOUR TOXIC VENEER   \nSO YOU SAY IT'S PROBABLY THROUGH, JONNY BOY   \nBUT WHERE DO YOU GO FROM HERE   \n\n(Slowly since JONNY is still unable to answer)   \n\nWHERE DO YOU GO FROM HERE\n\n>JONNY: Well...I...I...I...\n\n## Scene 6\n\nEDDIE'S VOICE: Jonny Warner, that’s quite a story.\n\n>JONNY: Thanks, Mr. Flagrante\n\nEDDIE'S VOICE: Anything you want to say to the kids out there, Jonny?\n\n>JONNY: Study hard and stay in school.\n\nEDDIE'S VOICE: And..?\n\n>JONNY: And...? Oh! “My life may have stalled out, but your car will keep running with Motorwise Gasolines!”\n\n### after Where Do We Go From Here Reprise\n\n>JONNY:   (Holding out a beautiful lily corsage) How about it, Toffee? Where do we go from here?\n\nTOFFEE:   (Taking the corsage) I don't know Jonny, but wherever it is...it's together.\n\n>JONNY: Together?\n\nEDDIE: You'd never be able to live with yourself having thrown out ---YOUR OWN SON! (Insane music. Everyone gasps.)\n\n>JONNY: Mom?\n\nEDDIE:   \nAND WITH JONNY HERE   \nI ONLY HAD TO LOOK BENEATH THE GOO   \nAND IT SUDDENLY WAS CLEAR   \nHE WAS THE SON I NEVER KNEW\n\n>JONNY: Dad?\n\nMISS STRICT:   (Hesitantly) Oh, Jonny! I...I suppose this changes everything...\n\n>JONNY: But I'm...I'm still dead.\n\nMISS STRICT: Oh, details, details... Maybe I'm the one who needs to change. How about it? Give me another chance, Jonny. Maybe I can be the mother you never knew. And hey, what's say that next week we throw you a big, fancy funeral? We'll do it up right.\n\n>JONNY: I don't know...\n\nMISS STRICT: Ice cream. Any flavor you want.\n\n>JONNY:   (Tearing up) And a cake? Can we have a cake?\n\n### During Zombie Prom\n\n>JONNY:   (Over singing) It's a tough world out there, Toffee.\n\nTOFFEE: I don't care, Jonny.\n\n>JONNY: I don't know if I can promise you much of a future. (eyeing the audience) There are bound to be a lot of people who won't accept us as a couple.\n"}