{"id":"nnqeqlcryl8","title":"DarknessFalls","content":"## Scene II\n\n(Sal is entering his building, getting his mail. His neighbor, a pretty girl, moves past him)\n\nSal: Hi Carol.\n\n(She sees him and acts surprised)\n\n> Carol: Oh hi Sam.\n\nSal: It’s Sal.\n\n> Carol: What?\n\nSal: My name is Sal. You’ve lived next door to me for the last two years.\n\n> Carol: (Laughing) Oh that’s funny Sam. You got me good with that one.\n\nSal: No it really is, I mean I really have… nevermind, it doesn’t matter. I was wondering, if you’re not too busy, if you might want to go have a drink.\n\n> Carol: I would love to.\n\nSal: Really?\n\n> Carol: Sure, that sounds great; I could really use one.\n\nSal: Where would you like to go?\n\n> Carol: Maybe to the Olive Garden. It’s a nice place, and the guys leave you alone there, on account of their embarrased to be seen at the Olive Garden, and usually they’re sipping on something large and fruity.\n\nSal: I don’t thinks that’s very politically…\n\n> Carol: What’s not politically?\n\nSal: I mean fruity is not a good way of describing something, it’s offencive to…\n\n> Carol: I meant like something that’s got pinapple or an orange in it.\n\nSal: Oh, I thought you were talking about…\n\n> Carol: You know, one of those gay drinks.\n\nSal: Oh, well… I mean that’s what I was talking about…\n\n> Carol: Don’t have to worry about a guy who’s drinking one of those hitting on you.\n\nSal: Don’t worry, I won’t let any guys hit on you.\n\n> Carol: How would you know if guys were hitting on me.\n\nSal: Because I’ll be sitting next to you or across from you, I mean I’ll be there with you, at the Olive Garden.\n\n> Carol: Why would you be at the Olive Garden?\n\nSal: Because you said you would like to go have a drink.\n\n> Carol: And I would.\n\nSal: Well that’s… because I would be sitting next to you while you have a drink.\n\n> Carol: You mean you were asking if I want to go have a drink with you? (she starts laughing histerically) What?! Oh Pam! You are so funny.\n\nSal: It wasn’t meant to be a joke. I was really…\n\n> Carol: You had me going fram. You should be on one of those prank shows, where they jump out of a bush and scare someone. (Screams like she is scaring him, he jumps) See. It’s funny.\n\nSal: (Hurt) That’s a good idea. Maybe I should make a video where I jump out of your bush.\n\n> Carol: what?\n\nSal: A bush! Not your bush, I mean I don’t even know if you have a bush, maybe it’s all slick down there. It’s not like I’ve been peeking in your bathroom window, I would never do that, so I have no idea about your down there, your down stairs area, where you keep your… vagina.\n\n> Carol: (Shocked)That is not appropriate Spam! How dare you talk about my bush like that! You’re not even old enough to be thinking about things like bushes or vaginas. (she slaps him) Pervert!\n\nSal: I’m sorry, I’m just a teenager and I get nervous about sex stuff. I didn’t mean to…\n\n> Carol: Just shut the fuck up Sack. I have to take this mail home and I don’t have time to listen to anymore of your teenage ramblings. (she moves past him)\n\nSal: None of the last three names you’ve called me are real names, one of them is not even a real word.\n\n> Carol: Whatever! I’m going to read all this mail on the table right by the cradenza where I keep my Machete, for chopping stuff, then I’m going to get in my older car, the one with the messed up brakes, and drive on that mountainous road to get to the Olive Garden, and don’t even try to follow me!\n\nSal: What’s a cradenza?\n\n> Carol: I forget how young you are sometimes. A cradenza is like a cabinet with drawers and a couple of doors on the front. You can use it to store stuff, like weapons or machettes. Anyway, it doesn’t matter, because I will never show you my cradenza. You’ll never see it, not even if you beg.\n\nSal: Okay I’m not going to…\n\n> Carol: Just shut up! You can’t see it, so stop begging!\n\nSal: I’m not, I don’t even want to see it. Unless you really want to show it to me.\n\n> Carol: I don’t! Never!\n\nSal: Okay, well, I think I’m going to…\n\n> Carol: NEVER!\n\nSal: home now. Okay, okay, I promise not to ask again. I’m just going to go\n\n> Carol: Maybe you should. I mean, how could you think I would go to the Olive Garden with a kid like you? I am way too hot for you. Who do you think you are, Burt Reynolds.\n\nSal: Why does everyone keep talking about him?\n\n> Carol: Just go, and don’t ever come back.\n\nSal: But I live here.\n\n> Carol: Oh right. Okay, you can come back, but sneak in through the fire escape so I don’t have to look at your sickening face.\n\nSal: I don’t have a fire escape. How about the window?\n\n> Carol: I don’t give a shit how you do it, just be sneaky, like you would be if you were going to break into my apartment to sniff my panties or to seek revenge for me spurning you; rummaging through my cradenza looking for the machete I keep in the top drawer; or maybe cutting my break line to my crappy car so I would drive off the side of that mountain on the way to the Olive Garden, where everyone is like family, a big Italian family, but you don’t have to be actual family, and there’s no actual Italians, so it’s mainly Irish immagrants, while taking into account that everyone at the Olive Garden knows me, and know’s my breaks are shitty, because they grind when I press on them and everyone in the parkinglot can hear it. That’s how sneaky I want you to be.\n\nSal: Wow, that is super specific.\n\n> Carol: What does spalsilfic mean?\n\nSal: I’m not sure what you’re saying.\n\n> Carol: Spasilfic, that word you just said.\n\nSal: Spa-cific?\n\n> Carol: Yes, that one, college boy.\n\nSal: it means…\n\n> Carol: Just shut the fuck up flap! I don’t ever want to see you again. (She exits, camera pans to his face, and there is a tear rolling down his cheek)"}