{"id":"nnqeqlcryl8","title":"Bridges","content":"# Act 1\n## Scene 2: Robert arrives\n\nFrancesca: Good afternoon.\n\n(He hands her a business card)\n\n> Robert: Afternoon to you, ma'am. My name is Robert Kincaid, and the great National Geographic Magazine has sent me out to take pictures of these famous covered bridges you've got here. Except my editor told me there were seven of them, and I can only find six. This last one...\n\nFrancesca: The Roseman Bridge, I bet.\n\n> Robert: Yes, that's the one. I'd be grateful if you just tell me where the bridge is, that's all.\n\nFrancesca: It's not far, but the locals have taken down all the signs. Kind of a joke, I guess.\n\n(A car goes by and honks. Francesca smiles and waves.)\n\n> Robert: You're not a local?\n\nFrancesca: I live here. With my husband and kids. But – (A bit surprised) I'm not from here, no.\n\n> Robert: Your accent is Italian. I was in Naples just a little while ago.\n\nFrancesca: You were?\n\n> Robert: Uh-huh. Now to get to this Bridge...\n\n(The mention of home made her feel funny for a moment. But she gets hold of herself and gives the directions)\n\nFrancesca: okay. To get to the Roseman Bridge from here, you head away from town and take a left at the third brown barn.\n\n> Robert: (Laughs) Third brown barn. You know what? I only needed to be there for five minutes, it's too late to shoot today. So I think I'll just go check into the Motor Court and start again in the morning. I'm sorry I bothered you.\n\nFrancesca: It's the brown barn with a bright blue silo beside it.\n\n> Robert: Oh, OK. I remember seeing that.\n\nFrancesca: Then after the barn, turn left, and go around the tractor, which John leaves on the road this time of year.\n\n> Robert: On the unmarked dirt road.\n\nFrancesca: It sounds worse than it is. If it would help, I can drive over there and you can follow me in your truck.\n\n> Robert: No, no. I don't want to be any trouble.\n\nFrancesca: It's no trouble, I was going to the library anyway, (Looking at her watch) but it's closed now, so–if you're really only going to be there five minutes, there's no point to even taking two cars. I'll just ride with you, and then you can bring me back here on your way to the Motor Court.\n\n> Robert: Thanks. That's great. Thank you.\n\nFrancesca: It's alright. When I first moved here, I got lost everyday. I'm Francesca.\n\n(They shake hands. Music starts)\n\n> Robert: Much obliged.\n\n(They walked to the truck.)\n\nFrancesca: Where are you from, Mr. Kincaid? You sound like you might be Southern.\n\n> Robert: I was born in Texas, but I live in Seattle now.\n\n(Arriving at the truck)\n\nI'm sorry this truck is such a mess. Long trip like this I kind of live in it, so she gets real...\n\n(He opens the door and closes it)\n\nFrancesca: You just drove halfway across the country?\n\n(He seems relieved to be asked to a real question)\n\n> Robert:  \nI left eight days ago from Washington.  \nI've got a place there on the sound.  \nTook route 2 east out of Spokane.  \nOh, this old truck, she's been around.  \nWent through Kalispell and North Dakota,  \nHit Minnesota on the way.  \nWent around Lake superior,  \nHit Des Moines earlier today.  \n  \nAnd I've been looking for something  \nAt ev'ry bridge that I crossed,  \nAnd sometimes you can feel  \nLike time becomes unreal  \nWhen you are temporarily lost.\n\nFrancesca: Right, go right. I'm sorry\n\n> Robert:  \nYou spend your time behind the camera,  \nSometimes you almost disappear.  \nYou see a waterfall in Cameroon,  \nAnd start to wonder why we are here.  \nYou've gotta touch it with your fingers,  \nAnd feel the way the water flows  \nUntil you figure out the meaning.  \nAt least, I think that's how it goes.  \n  \nSo I've been looking for something,  \nAnd who can reckon the cost?  \nYou chase it every day.  \nYou think you're on your way,  \nAnd then you're temporarily lost.  \n\nFrancesca: There it is. Just around the curve. Roseman Bridge.\n\n> Robert:  \nAnd now, it seems to me  \nThe way you find the key  \nIs to be temporarily lost.  \n\n### At Roseman Bridge\n\n(He pulls the truck over and stops)\n\n> Robert: (Seeing the bridge) Oh now, that's a beauty. Be perfect for a sunrise shot in the morning. (Opening his door) I'd like to do a little recon right now if you don't mind.\n\nFrancesca: I'm fine. I haven't been over here for a long time. I'll just wait here.\n\n(She watches him as he approaches and examines the bridge. At some point, she finds a pad of paper from her purse into pencil and begins to sketch.)\n\n> Robert: I know I said five minutes, but it could be more like ten.\n\nFrancesca: Take your time.\n\n> Robert: Then I'll drive you back home.\n\n\nFrancesca: ...  \nComes someone so ridiculous,  \nSo earnest,  \nSo strong?\n\n(It's clear enough that these are two great-looking people on either side of the bridge, in this bridge will be crossed. He returns from the bridge, get the car.)\n\n> Robert: There we go. All done. You ready? (A beat, then:) Just give me one second. (He takes a final look, then the drive home.)\n\nFrancesca: ...  \nSomething holy—  \nSomething newly born  \nWithout a name.\n\n> Robert: What were you doing? Sketching the bridge?\n\nFrancesca: No, no. Grocery list.\n\n### At Francesca's house\n\nFrancesca: Just drive around to the back.\n\n> Robert: The back.\n\nFrancesca: You can park in the shade there while I get us a glass of tea.\n\n(He stops the truck)\n\n> Robert: I should get going.\n\nFrancesca: I know, but aren't you hot? And the tea is already made.\n\n> Robert: All right, then. (Then quickly) But I need to keep my film as cool as I can. You don't have any extra ice, do you?\n\nFrancesca: You can put your film in the fridge if you want. I read that photographers have to do that sometimes.\n\n> Robert: I'll just fill the cooler with ice. Thank you, though. (He gets his cooler and followed her into the house.)\n\nFrancesca: Okay. Come on in.\n\n### Inside the house\n\n(He sets down his cooler, not quite knowing what to expect. Then he watches as she takes her boots off, and pours them each a glass of tea.)\n\nFrancesca: I hope you like your tea with sugar.\n\n> Robert: I do.\n\n(She drinks her is down quickly)\n\nFrancesca: Ah.\n\n> Robert: Is that what you do first when you come in the house? Take off your shoes?\n\nFrancesca: I guess I do. Not you, I see.\n\n> Robert: No ma'am. Real cowboy's supposed to die with his boots *on* if he can.\n\nFrancesca: Is that how you think of yourself, as a cowboy? (She pours more tea)\n\n> Robert: Not really. I don't know why it said that.\n\n(Then suddenly, she remembers the film.)\n\nFrancesca: Oh the ice! (Opening the freezer section) I was so thirsty I forgot about the ice for your film. (She pulls out eight trays)\n\n(He brings the cooler to the fridge and they open ice cube trays – the old metal kind. This makes a lot of noise, and these trays are very cold. She makes a little yelp as the first one.)\n\n> Robert: Wait. Let me help. These ice trays stick to your fingers worse than the ice. (And sure enough, he has some kind of trick that makes the ice cubes come out perfectly. She stands back and watches as he feels his cooler, picks the whole thing up and heads outside.) That should do it. I'll just go get my film.\n\n----------\n\nMichael: Is that what you're going to do? Call mom for the rest of your life?\n\n(Robert reenters. He has a six pack of beer and has on a clean shirt.)\n\n> Robert: Trouble?\n\nFrancesca: No, no. Caroline and Michael are with their dad on their way to the Indiana State fair. It's the 4H national finals and Caroline has a very good chance of– (Stopping herself) I'm sorry. My children are at a gas station arguing about who gets to wear the lucky red shirt.\n\n> Robert: And you said the girl should get the shirt.\n\nFrancesca: I did. How did you know?\n\n> Robert: Boy should have to work for his luck. Girls need it more, with everything they're up against. (She notices the beer) I had some beer in the cooler. I thought you might like to join me.\n\nFrancesca: That sounds good, actually.\n\n> Robert: OK, then. One beer and then I'll leave you to your peace and quiet.\n\nFrancesca: You washed up and put on a clean shirt.\n\n> Robert: I did. You can't count on those Motor Court showers. I figured I'd clean up while I had the chance. Here you go. (Hands her a beer)\n\nFrancesca: What do you mean, with everything girls are up against?\n\n> Robert: I guess it's just some of the stuff I've seen in the world. (Stopping himself) I shouldn't have said anything.\n\nFrancesca: No, please.\n\n> Robert: Truth is, I started to just drive off in the truck, but then I thought that would be rude, after you were so nice to me, so I came back in. But I warn you, I am not very good company.\n\nFrancesca: I'm glad you didn't leave. I was hoping maybe you'd show me some pictures of Naples. That's where I'm from. (Sensing his reluctance) Didn't you say you were in Naples recently?\n\n> Robert: I was. But I'm not sure I have those with me. (There is an uncomfortable silence, then) But I appreciate... all this. (Now a toast) To the National Geographic.\n\nFrancesca: To the National Geographic. (They clink bottles. Then drink.)\n\n> Robert: I've never been to the real middle of the country like this. It feels really empty.\n\nFrancesca: I know. It's not what I dreamed of as a girl. But it's very quiet here. And the people are nice. Bud told me when we first met–\n\n> Robert: Is that what you call your husband? Bud? The mailbox says Richard Johnson.\n\nFrancesca: Bud's what everybody's call him since he was a boy.\n\n> Robert: So \"Bud\" told you when you met –\n\nFrancesca: ... (Song)\n\nBud:  \nYou're never alone.  \n(Then Bud leaves the stage and Robert and Francesca are alone)\n\n> Robert: So the houses might look empty, but they're not.\n\nFrancesca: No, no. Everybody is either working, or... looking out their windows.\n\n> Robert: Well. I guess that's my cue to go. Wouldn't want to your neighbors coming over to ask what my truck's doing in your backyard. I saw two restaurants in town for supper. Is either one of them–\n\nFrancesca: Oh no. I wasn't thinking. Both those places are closed now. In the motor court only has a vending machine. There's really no place for you to eat until... Des Moines, and they might be closed by the time you get there.\n\n> Robert: It's okay. I've got some carrots in the truck. Coupla apples, that'll do. What time does everybody open up for breakfast?\n\nFrancesca: Early. But that's when you want to be taking your pictures.\n\n> Robert: Okay then. I better get going.\n\nFrancesca: (She knows he won't make it) No, no. It's too late. Why don't I make you dinner, we could eat together, I mean. I can make pork chops and vegetables...\n\n> Robert: No, no. I can't. I'm good. (He stands as if to go. A moment)\n\nFrancesca: Mr. Kincaid. In Italy we would never let anybody leave hungry.\n\n> Robert: I know that alright. I never ate food like that in my whole life. Is there something you Italians know that the rest of us don't?\n\nFrancesca: Maybe.\n\n> Robert: Okay then. I accept. But just vegetables for me. I don't eat meat anymore. It's not a big deal. I just feel better when I don't. Tell me what I can do.\n\nFrancesca: Just go out to the garden and pick whatever looks good. Will make a vegetables do with dumplings. And salad. I'll get cleaned up and meet you right back here.\n\n> Robert: Sounds good.\n\n----------\n\n### Back in Francesca's kitchen\n\n(Robert is rinsing vegetables at the sink as she comes down the stairs. He has brought a beat-up acoustic guitar into the house with him and leaned against the wall she's wearing a clean pair of jeans and a white shirt, the sleeves rolled up, and sandals.)\n\n(He turns around to look at her. He's knocked out by her beauty, and starts to say so. That changes his mind. She still smells of the shower and he's doing good to speak at all.)\n\n> Robert: You... You've got an amazing garden.\n\nFrancesca: Thank you. (Then notices guitar) Oh good. You brought in your guitar. I saw it in the back of the truck. I was hoping you maybe play something for me. I never get to hear any real music.\n\n> Robert: The guitar's not really mine. Well, I guess it is now. I mean, it belonged to my ex-wife, Marian. I can't play worth a damn, but it's not good to leave it outside. I don't want it in my house, though, and I can't leave it in the truck. So I don't know *what* to do with it.\n\nFrancesca: Well, that's probably why she gave it to you.\n\n> Robert: I don't understand.\n\nFrancesca: So you wouldn't forget her. Let's see what you've found for supper.\n\n> Robert: (Drying his hands) It's all washed and ready. Squash, leeks, potatoes, carrots, fennel, basil, tomatoes.\n\nFrancesca: My Poppa liked fennel. I think I'm the only person in this county who even grows it.\n\n> Robert: I had this amazing soup in Italy, in a tiny little town somewhere. I tried to remember what was in it, and just picked that. I could be wrong about the leeks, but I know there was fennel.\n\nFrancesca: I can make you that soup.\n\n> Robert: So I did OK.\n\nFrancesca: (Teasing him) No kale, I see.\n\n> Robert: I don't like kale. Was I supposed to get kale?\n\nFrancesca: No. It's kind of an American thing.\n\n> Robert: How about another beer?\n\nFrancesca: I'm sorry I don't have anything else for us to drink. Though... There might be a bottle of brandy in that cupboard, if you want to look.\n\n> Robert: I could use a brandy. This cupboard?\n\nFrancesca: I'll get it.\n\n(She puts down her knife and grabs the kitchen chair. With his help, she gets out on the chair and pushes things around in the upper cupboard until she finds the brandy.)\n\n(Handing it to him)\n\nHere it is. I hope it's still good.\n\n> Robert: I'm sure it will be. It hasn't even been opened. How did it get there?\n\nFrancesca: Oh I bought it once, a couple of years ago, thinking... (Decides not to tell) Thinking we might enjoy it. But I guess we never got around to it.\n\n> Robert: And do you still think you might enjoy it?\n\nFrancesca: I wanted to know what it tasted like.\n\n> Robert: Well then. There's no time like the present. (He opens the bottle, looks in the cupboard, find two glasses and pours them each a drink.)\n\nFrancesca: I thought it was an after dinner drink.\n\n> Robert: Well normally it is, but after dinner tonight, I'm going to drive back to the Motor Court, so I can be at that bridge at dawn. And I think this bottle has waited long enough.\n\nFrancesca: All right then. (They clink glasses again and she takes to sip) Oh my goodness. Is this what it's supposed to taste like?\n\n> Robert: Exactly.\n\nFrancesca: I like how it burns a little, at the end.\n\n> Robert: You picked a good one.\n\nFrancesca: Are you still in touch with your ex-wife? Marian?\n\n> Robert: No. And I don't know if my parents are alive, or where my brothers and sisters are...\n\nFrancesca: I didn't mean to pry.\n\n> Robert: I keep to myself, that's all. (Then realizing she's looking at him) But I don't want to be rude. So. Ask away.\n\nFrancesca: Skin these carrots. Was your ex-wife a photographer to?\n\n> Robert: No, she was a waitress... Who wanted to be a singer, or some kind of something else. She was young though, so... Who knows what she is now.\n\n----------\n\nFrancesca: I think it needs a little more pepper, what do you think.\n\n> Robert: Do you have a...\n\nFrancesca: Pepper grinder, I sure do. (She opens the cabinet and gets it)\n\n> Robert: You brought this with you from home.\n\nFrancesca: I did. And a box of mamas recipes. I could make real mozzarella if anybody in Iowa would eat it. (Then looks at him) You would eat it.\n\n> Robert: With tomatoes and basil, you bet I would.\n\n----------\n\nMarian:  \nAnother life.  \nAnother life.\n\n> Robert: That was a great supper. Let me clear the table.\n\n----------\n\nFrancesca: Everything's fine. I love you. (She hangs up the phone and Robert takes a sip from the stew) That was my husband.\n\n(Robert is listening up a little. He tries a question.)\n\n> Robert: Why didn't you go with them? (He pours them another brandy.)\n\nFrancesca: They have a better time without me. Take hundreds of pictures of the stairs. So I just can just watch this slideshow when they get back. \"Mom, mom, look at this pig!\" OK. \"And this watermelon.\" Wow. It's as big as the pig.\n\n> Robert: It's hard to take a good picture. Sometimes I see tourists taking pictures and I want to say, \"get closer,\" you know? \"Move in on the thing so we can see it.\" And turn your camera up to vertical, especially if you're taking pictures of people. People are vertical. Usually. (A beat) Are you an artist? I thought your sketch of the bridge was good.\n\nFrancesca: Drawing is what I studied in school. It's all I ever wanted to do.\n\n> Robert: But you got married and moved to Iowa and...\n\nFrancesca: And now I'm just draw for myself, when I have time.\n\n> Robert: I'll wash the dishes if you want. You dry.\n\nFrancesca: No, no. I'll do them after you go.\n\n> Robert: (He smiles) Okay. Roseman Bridge at dawn. I better get going. (He grabs his backpack and any cameras he brought into the house. They walked to the back door.)\n\nFrancesca: I enjoyed talking with you.\n\n> Robert: Thanks again for everything. But especially that wonderful supper. I don't remember the last time anybody cooked for me. And I was thinking maybe if you kept that brandy at the front of the cupboard, or even out on the counter, you might get a little more enjoyment out of it.\n\nFrancesca: I'll try that. Good night. Take care.\n\n> Robert:  \nA little twinge,  \nA little shock,  \nA little whisper at the bottom of your memory.  \nA sudden wind,  \nA gentle knock,  \nAnd then a russell in the leaves.  \nYou hold your breath,  \nYou check the lock,  \nYou reassure yourself that nothing's at the window.\n\nBut you're wondering.  \nYou're wondering.  \nYou're wondering what that was.  \nNothing's gonna happen.\n\nFrancesca:  \nNothing's gonna happen.\n\n> Robert:  \nYou turn a key,  \nYou flip a switch,  \nYou settle back into the blissful unfamiliar.  \nYou close your eyes,  \nBut there's an itch,  \nA little hurt your heart retrieves.  \nBut you ignore  \nThe tiny twitch,  \nPretend the feeling will be gone before the morning.\n\nBut you're wondering.  \nYou're wondering.  \nYou're wondering where you are.  \nNothing's gonna happen.  \n\n> Robert & Francesca:  \nNothing's gonna happen.\n\n> Robert:  \nBut wouldn't it be fine to share  \nThe weather in her eyes, her hair,  \nHer footsteps as she climbs the stair,  \nThe shadow in her light?\n\nBut everything you know is true  \nAnd everything you want to do  \nAnd everything that makes you you  \nCollides against the night.  \nAnd nothing's black and white.\n\nAnd you're wondering.  \nYou're wondering.  \nYou're wondering what to do.  \nYou're wondering.  \nYou're wondering.  \nYour wondering if it's true.  \nNothing's gonna happen.  \nNothing has to happen.\n\n\n## Scene 4: Roseman Bridge\n\nFrancesca: Mr. Kincaid? Mr. Kincaid... (He is behind her)\n\n> Robert: Right here.\n\nFrancesca: Oh, you scared me.\n\n> Robert: (As he shoots) I'm happy to see you. How did you know I'd still be here?\n\nFrancesca: (A moment) You're causing quite a commotion in the town.\n\n> Robert: Oh, I know. People been drivin' by all day taking pictures of the hippie taking pictures of the bridge.\n\nFrancesca: Did this ever happened before?\n\n> Robert: Everywhere I go. Like it's not right for a man to just be passing through. You'd think I'd be used to it. But I'm always suspect somehow. That time I went to Iceland, the lady wouldn't rent me a room because she said I was one of the Hidden People. Said her mother told her you should never go into a cave with a Hidden Person, so no room for me. (He waits, with his camera just below his eye.)\n\nFrancesca: Have you been working all day?\n\n> Robert: Not really. I've mainly been waiting.\n\nFrancesca: For what?\n\n> Robert:  \nIt starts with the light.  \nIt's like you wouldn't even know which way to look  \nUntil the sun showed you a line,  \nShowed you a corner,  \nBuilt you a frame,  \nThen you can see.\n\n(He walks to her, points at the bridge)\n\n(Spoken:) See?  \n(Now he puts the camera in front of her)  \n(Spoken:) Now: See?\n\nSee the world!  \nHere's the world through a small, small window.  \nYou thought it was bridge,  \nYou thought it was the water,  \nYou thought it was the sky...  \nIt's the world, inside a frame.\n\nAnd you wait.  \nAnd you wait.  \nAnd you wait.  \nAnd you...  \nRight there, something shifted! Something...  \nThat tree threw a shadow! Did you...?\n\n(Excited but controlled, he clicks the shutter)\n\nThere! There! There!  \nIt's like all you didn't know that you were waiting for  \nIs just outside the frame,  \nAnd it can change  \nThe way you see...\n\n(He lowers the camera)\n\nSee the world!  \nHere's the world in a box forever.\n\n(He looks at Francesca. Sees something)\n\nGo stand over there.\n\n(She walks to where he's pointing. He raises the camera to his eye.)\n\nDon't look at me.  \n-Now:  \nLook at me.\n\n(She does. Electric.)\n\nLook at me.  \nThere. There.  \nThere. There.  \nThere.\n\n(He continues taking pictures of her, and then the role is finished)\n\nThere's the world.  \nThere's the world in your face, Francesca.\n\nDon't worry. This is not for them. This one is for me.\n\n(He puts the camera away, digs into his bag and pulls out the canteen.)\n\nOK. All done. Are you thirsty?\n\nFrancesca: So thirsty.\n\n(They sit on the bench. He offers her a drink from his canteen)\n\n> Robert: Here you go.\n\nFrancesca: (As she drinks) What happens after you take the pictures?\n\n> Robert: I'll drive into Des Moines tomorrow and send the rolls of film to New York. Then I'll wait around the Motor Court til they call me and say if I got what they want, or not. Then I'm off to New York to take pictures of the Hare Krishnas.\n\n(He brings out another package it is wrapped in brown paper)\n\nI brought you a present. I was going to leave it in your mailbox.\n\n(She gives him back the canteen and takes the package)\n\nFrancesca: What is it?\n\n> Robert: On my way out of Seattle, I picked up a big bag of mail. Last night I went through it and look what I found.\n\n(She opens the package. It's a magazine.)\n\nFrancesca: Is this what it looks like now?\n\n> Robert: The rest of it is on page 43. Naples Today. They said it was the most bombed city in the war. That's why they sent me there. To document the reconstruction.\n\n(When she arrives at the page, her eyes water suddenly.)\n\nI'm sorry. I thought it would make you happy.\n\n(She looks through the pages)\n\nFrancesca: It's all the places that were destroyed by the bombs. Only here, it's all back the way it was. This is where I went to the market with Mama. That's our church. And there's my... There's my bench.\n\n> Robert: I took that picture because it was the only thing that seemed to have survived intact.\n\nFrancesca: That bench at the Harbor is where I waited for my fiancé, Paolo to come back from the war.\n\n> Robert: But he didn't come home.\n\nFrancesca: No. (There is a moment. she turns more pages.) Oh look at it! I miss it so much. I didn't know how much. I ran away from home and now I can't get back. Please forgive me. Can I keep this?\n\n> Robert: I brought it for you.\n\nFrancesca: I will look at it again on a day when I'm not so... weepy. I'm sorry. Will you come to supper tonight?\n\n> Robert: Of course. I'll go back to the Motor Court and clean up and be there in about an hour.\n\nFrancesca: You can use my shower to clean up.\n\n> Robert: Okay then. I'll pack up and be right there.\n\nFrancesca: Robert, thank you for this.\n\n> Robert: This is what we hope for, that someday, one picture will make a difference to somebody.\n\n## Scene 5: The second evening at Francesca's house\n\n(They walk into the house Robert carrying the cooler)\n\nFrancesca: Shower is just down the hall there, and I'll take my bath upstairs.\n\n> Robert: Want a beer for your bath?\n\nFrancesca: Thank you. (She takes the beer in the phone rings. He heads for the shower.)\n\n----------\n\n### In the kitchen\n\n(Robert is finishing up cleaning a camera and she walks in. He looks up)\n\n> Robert: You are so beautiful.\n\n(She stands perfectly still. She doesn't move. He gets up to move toward her.) Do you know how beautiful you are? How did I get here?\n\nFrancesca: I invited you. (They look at each other for a long moment) Either that, or the patron saint of Iowa housewives sent you to me. Or my sister, Chiara. She would like this alright. I'm feeling like a boring housewife but you come along and I feel like myself again.\n\n(As she passes him, he raises his hand out to stroke her shoulder.)\n\n> Robert: Is it okay if I touch you?\n\nFrancesca: Is this what always happens when you come to a town? You meet a woman who opens up to you for some reason, she doesn't know why, and before she knows it, she's bought a new dress and invited you for dinner again and—\n\n(He stops)\n\n> Robert: No. I tried to leave yesterday. I tried not to eat supper here. You saw that.\n\n(She laughs a little and nods, and maybe reaches her hand up to touch his hand on her shoulder)\n\nNo, this isn't always what happens. I *never* let this happen. I never go into this world where people belong to each other.\n\n(Steps away a little)\n\nAs soon as I know I got the shots they need, I will be gone and on to the next job. So I know I can't stay anywhere, regardless of what happens. This is why...\n\n(Taking his time to remind her)\n\nI never walk in the house, I never drink the tea, I never stay for supper, I never come back the next night, I never get this close, I never touch your arm, I never do this.\n\n(He kisses her)\n\nFrancesca: I understand.\n\n> Robert: And you don't do this either.\n\nFrancesca: No. I don't.\n\n(They kiss again)\n\n> Robert: So if you're going to make me go to the Motor Court, do it now, OK. I think I could leave now if you wanted me to.\n\n(He kisses her again)\n\n(The phone rings. She starts not to answer it, but he motions to her to take it. She moves across the kitchen to the phone on the wall behind him)\n\n----------\n\nFrancesca: Bye, Marge. Say hi to Charlie for me.\n\n(She hangs up the phone, gently separates from Robert and moves toward the sink. He walks to the radio.)\n\n> Robert: So you're coming with me to Des Moines tomorrow?\n\nFrancesca: If I'm invited.\n\n> Robert: You are. How would you feel about a little music?\n\nFrancesca: I'd like that. I don't know what stations have the music though. We only use the radio to listen for the weather and the price of corn.\n\n(He finds the station with no trouble at all. She seems very nervous. She should be cooking now, but she doesn't want to. He finds a big-band song.)\n\n> Robert: How's that?\n\nFrancesca: I like it. (She looks at the pasta on the counter) Would you like to have supper? I could have the pasta ready in a minute.\n\n> Robert: What I would like to do... is dance.\n\n(The music begins to come up over them, like a fog creeping in the door. They moved toward each other.)\n\nFrancesca: Okay.\n\n(He smiles, puts his beer on the counter and takes her hand.)\n\n----------\n\nMarge:  \n'Cause I'm ready and I'm waiting  \nDaddy, let me get closer to you.\n\n(Marge exits)\n\n(As the song finishes in music, Francesca and Robert are dancing very slowly, her head buried in his neck. She tilts her head up.)\n\n(They kiss.)\n\n(He kisses her again and another melody comes up under the radio tune)\n\n> Robert:  \nWhat was I saying before about being lost?  \nThe thing is, I knew where I was,  \nBut not where I was going.  \nWhy did I walk those mountains?  \nWhy did I ride those ships?  \nWhy did I watch those horses running wild?  \nNow I know.  \nNow I know.\n\nAll my life, I have been falling.  \nI have been falling into you,  \nFrancesca.  \nCircling in the sky,  \nLooking for a harbor  \nComing into view.  \nAll my life, I have been falling  \nInto you.\n\nFrancesca:  \nWhatever this is...  \n...  \nTo know this moment,  \nTo cross this line.\n\n> Robert:  \nAdding up all those minutes  \nStaring through all I saw,  \nHow could I know the answer  \nWould it be you?\n\nFrancesca:  \nHow could I know the answer  \nWill you be you?\n\n> Robert:  \nOnly you.\n\n> Robert and Francesca:  \nAll my life I have been falling.  \nI have been falling into you,  \nFrancesca.  \nThis is where I land.  \nYou are what I've looked for.  \nNow is what it is true.  \nAll my life,\n\n> Robert:  \nI have been falling  \nInto you.\n\n# Act 2\n\n### After State Fair song\n\n> Robert:  \nMaybe you sleep so peaceful  \nBecause you haven't got a worry in your head.  \nMm.  \nOr maybe you keep your eyes closed  \nSo you never have to get out of this bed.  \nMm.  \nWell, you don't have to make the toast  \nOr get the kids to school,  \nSo rest your head and stay here close to me.  \nThere's nothin' in this world today  \nBut who we are and who we want to be.\n\nMaybe I'm being selfish.  \nI should get my things and walk out of that door.  \nMm.  \nBut maybe we both deserve this.  \nAnd besides, how could I keep from wanting more?  \nMm.\n\nAnd lying here with curtains drawn,  \nYour hair across my chest,  \nI can't think what else I would need to see.  \nThere's nothing in this world today  \nBut who we are and who we want to be.\n\nCompany:  \nOh, Oh, (Etc.)\n\n> Robert:  \nAnd maybe after all these years  \nOf lookin' for a home,  \nA woman in a farmhouse held the key.  \nThere's nothing in this world today  \nBut who we are and who we're meant to be.\n\nFrancesca: That clock must've stopped. It can't be 10 o'clock in the morning.\n\n> Robert: Is that a bad time to be in bed?\n\n(A moment. Then he leans down to kiss her and then starts to stretch over her, but she stops him)\n\nFrancesca: I need to get up.\n\n> Robert: OK.\n\n(She sits up in the bed little, then realizes she is naked.)\n\n(She looks around for a robot or something)\n\nThis is when we need to be in a hotel, so we can just call downstairs and order some breakfast.\n\nFrancesca: Coffee at least.\n\n> Robert: Coffee would be good. I can make you a cup. Should I go down and do that? Are you hungry?\n\nFrancesca: I might be. I don't know.\n\n> Robert: OK. I'll cook too. How's toast and eggs?\n\nFrancesca: No you shouldn't have to cook breakfast.\n\n> Robert: It's OK. I have to leave in a little while anyway, get my film to the post office in Des Moines.\n\nFrancesca: Robert.\n\n> Robert: Yes.\n\nFrancesca: Is what I felt with you... is that what other lovers feel all the time?\n\n> Robert: No. (A moment) It was you.\n\nFrancesca: Well. It was never me before.\n\n(He kisses her gently.)\n\n> Robert: Well. It's you now. And me. It's us now.\n\nFrancesca: (Falling into him) Oh Robert.\n\n> Robert: You still want to drive to Des Moines with me this morning? How far is it?\n\nFrancesca: Far enough.\n\n> Robert: Far enough so I can kiss you in the street without getting shot?\n\nFrancesca: I think so.\n\n> Robert: So why don't you get dressed and I'll make us a breakfast to go. I'll put the coffee in my thermos. Is there anything else you'd like me to do?\n\nFrancesca: (Beginning to loosen up) That you haven't done to me already?\n\n> Robert: I was thinking like milk the cow. Don't you farm people have chores?\n\nFrancesca: I forget if we have a cow.\n\n> Robert: (Making as if to leave) I'll go check.\n\nFrancesca: Stop\n\n(He laughs, and goes back to kiss her with fierce happiness)\n\nDon't stop.\n\n> Robert: (Falling back into the bed) I adore you.\n\n## Scene 2: The kitchen/Des Moines\n\n(They have coffee in the kitchen)\n\nFrancesca: You really did make the coffee.\n\n> Robert: I really did.\n\nFrancesca: People laugh at me about that coffee pot.\n\n> Robert: Well, after the coffee I had in town yesterday, I'm glad to see it.\n\nFrancesca: Bud thinks...\n\n> Robert: Do you take cream?\n\nFrancesca: No.\n\n> Robert: I knew that.\n\nFrancesca: How did you know that?\n\n> Robert: Well, I'm sure this cream is good...\n\nFrancesca: It is. It's especially good whipped on top of–\n\n> Robert: Pecan pie.\n\n> Robert and Francesca: Or peaches.\n\n> Robert: But the coffee is better black.\n\nFrancesca: This is good. Not everybody knows how to make a good cup of coffee.\n\n> Robert: The other day, you said... This life wasn't what you dreamed of as a girl.\n\nFrancesca: No it wasn't.\n\n(They drive to Des Moines)\n\n----------\n\nFrancesca: (Ending the song:)  \nFar enough that I could feel  \nAlmost real.\n\n> Robert: And where is Chiara now?\n\nFrancesca: Still in Naples. With husband number four, I think. Still convinced I've wasted my life trying to be... perfect.\n\n> Robert: And have you been back to Italy at all?\n\nFrancesca: No. I'd love to go and take Carolyn and Michael. But it's money we don't have.\n\n> Robert: Still, you've been cooking for them, so that counts.\n\nFrancesca: And I sang to them in Italian when they were little.\n\n> Robert: I wish I was drinking your coffee.\n\nFrancesca: Here you go.\n\n(They laugh together about this)\n\nMichael should go to Italy. He should go somewhere. I'm worried that he's starting to hate everything here. Iowa is so flat, you feel like the only way out is to blast straight up like a rocket.\n\n> Robert: And you're worried what Michael might do to feel like he's \"out of Iowa.\"\n\nFrancesca: That's exactly what I'm afraid of.\n\n> Robert: And what does Bud think?\n\nFrancesca: But I won't tolerate her rebellion. I'm afraid he'll drive Michael away before he ... has a chance to leave on his own terms.\n\n> Robert: My father threw me out.\n\nFrancesca: So it could be a good thing, you mean. You turned out just fine.\n\n> Robert: I guess.\n\nFrancesca: What do you mean, you guess. Look at you.\n\n(The waitress brings them a check)\n\nWaitress: Can I bring you folks anything else?\n\n> Robert and Francesca: We're fine.\n\n## Scene 3 - The evening. Francesca's bedroom\n\nFrancesca: Ah!! I liked being out in the world with you today.\n\n> Robert: Well, I don't know if I call Des Moines \"the world,\" but I liked it too. Then again, I've never felt like this so I don't know what to call anything.\n\nFrancesca: Felt like what?\n\n> Robert: Dizzy. And happy. I don't feel like we are in Iowa. I feel like we've been picked up in a tornado and we're on our way to... (The phone rings)\n\n----------\n\nBud: Goodnight.\n\n(Robert feels something new from her but isn't sure what it is.)\n\n> Robert: Do you want me to go?\n\nFrancesca: No, please.\n\n----------\n\n-Torn in half:  \nBefore and after you.\n\n> Robert: I love you, Francesca.\n\nFrancesca: And I love you. More than my own life, I love you.\n\n> Robert:  \nFor the first time in my life,  \nI am not outside moment  \nWith a camera in between me and the world  \nI think I know.  \nFor the first time in my life,  \nI am somehow part of something.  \nYou surround me, you connect to me,  \nAnd I think I can't let go.  \nFor the first time in my life,  \nYou have opened up a channel  \nThere is nothing to contain us,  \nWe are joined, and we are free.  \nFor the first time in my life,  \nI am risking something precious.  \nI am asking you, Francesca:  \nCome with me.\n\nI can't tell you I know what the future will be.  \nWho knows anything?  \nI just look at those eyes; you've got so much to see.  \nLet me show you. There's  \nCrowds and camels and hillsides to climb.  \nAll I know is, in all of the time  \nFrom man's first breath  \nTo God's last warning,  \nYou and I are just one second,  \nSpinning by in one split second.  \nYou and I have just one second  \nAnd a million miles to go.\n\nI don't need to be rich, I don't need something new.\n\nFrancesca:  \nI don't want to go back to a world without this.\n\n> Robert:  \nAll I need, all I've needed my whole life was you.\n\nFrancesca:  \nIf I left this behind...\n\n> Robert:  \nPlease just look at me  \nYou were born with a wanderer's soul.  \nThis is how you begin to be whole.  \nThe stars keep burning,  \nWorlds keep turning\n\n> Robert and Francesca:  \nAnd you and I are just one second,  \nSpinning by in just one second,  \nYou and I have just one second\n\n> Robert:  \nAnd a million miles to go...\n\nFrancesca:  \nFound and lost.  \nTorn in half.  \nBefore and after you.\n\n> Robert:  \nCome with me.\n\nFrancesca:  \nOpen-heart,  \nOpen-door.  \nBefore and after you.\n\n> Robert:  \nCome with me.\n\nFrancesca:  \nHow do I go?  \nTell me.  \nHow do I go?  \nHow do I go with you?  \nHow do I pack a bag,  \nClose the door,  \nTurn a key,  \nWalk away?  \nLook at where I am  \nAnd who I am  \nAnd tell me.  \nIs there something I don't know?  \nHow do I go?  \nHow can I go  \nWith you?\n\n> Robert:  \nI can't tell you I know what the answer will be.  \nIt's impossible.  \nBut this thing, this is bigger than what we can see.  \nThis is destiny.  \nWe are tied, we are locked, we are bound;  \nThis will not be reversed or unwound.  \nWhatever fate the stars are weaving,  \nWe're not breaking,  \nI'm not leaving,  \nAnd do you and I are just one second.  \nSpinning by and just one second.  \nYou and I have just one second...\n\nFrancesca:  \nAnd a million miles to go.\n\n> Robert:  \nAll my life I have been falling...\n\nFrancesca:  \nAll my life I have been falling...\n\n> Robert:  \nAll my life I have been falling into...\n\nFrancesca:  \nAll my life I have been falling...\n\n> Robert:  \nYou and I\n\n> Robert and Francesca:  \nHave just one second\n\n> Robert:  \nAnd a million miles to go.\n\n## Scene 4 - Friday morning\n\n(It is nearly noon. Robert jumps out of the bed.)\n\n> Robert: Oh my God, Francesca, it's almost noon.\n\nFrancesca: No. It can't be. They couldn't be here in an hour. It could be here in half an hour.\n\n> Robert: Do you know what time they were leaving?\n\n(She jumps out of bed, put a robe on and begins to strip the sheets off the bed.)\n\nFrancesca: Maybe Bud told me, but I wasn't listening. You have to leave. I have to change that. I have to clean the kitchen and get dressed and...\n\n> Robert: Francesca. It's at least an eight-hour drive from Indianapolis, so even if they left at seven, you've got at least three hours before they get here, maybe four.\n\nFrancesca: Robert. They can't find you here.\n\n> Robert: Listen, I'll be in town all afternoon. But if George has the pictures he needs, I'll have to leave for New York by six.\n\nFrancesca: But what if I can't get there by six?\n\n> Robert: Then I'll wire you the money to come to New York. Or call the magazine. They always know how to find me. You call me and I will come get you. All you have to do, ever, is call.\n\nFrancesca: If you carry me to the truck right now and force me to go with you, I would ago.\n\n> Robert: Is that what you want?\n\nFrancesca: No, I don't want to leave without seeing them. I'm afraid if I did, the guilt of knowing how I have hurt them would turned me into someone you wouldn't love it all.\n\n> Robert: No. Not possible.\n\nFrancesca: Don't leave me, Robert.\n\n> Robert: I'm not leaving you. I'm waiting for you. (He runs down the stairs and she follows)\n\nFrancesca: Robert!\n\n> Robert: Six o'clock.\n\n----------\n\nFrancesca: Oh Robert. I love you. Take me with you.\n\n> Robert: OK. Let's go.\n\n## Scene 5 - Years go by\n\n----------\n\nFrancesca: Johnson's. Is someone there?\n\n(Shift 10 years and then to Robert's office)\n\n(We hear the phone ringing again. The lights change, and we find Robert sitting at his desk, over a large trashcan, into which he is throwing his photos.)\n\nGinny: National Geographic.\n\n> Robert: Hi Ginny. It's Robert Kincaid. Can you get George for me?\n\nGinny: He's in Nepal, Mr. Kincaid. He called you 100 times to get you to go with him. Where have you been?\n\n> Robert: You don't want to know. But I'm home now.\n\nGinny: George said if you called, he wants you there as soon as you can get there.\n\n> Robert: I can't go anywhere, Ginny. I called to say I'm kind of closing up shop here.\n\nGinny: You can't do that. You're the best we've got.\n\n> Robert: I don't know about that, but I'm not taking any more pictures. My doctors are telling me... Do you still have that number?—the one I gave you after I did those pictures of the covered bridges?\n\nGinny: I have it, but she hasn't called. Do you still want me to tell her how to find you?\n\n> Robert: No, don't give her the number now. I can't–Ginny, thank you so much for helping me wait for her call. In case she needed me.\n\nGinny: Of course. It was my pleasure.\n\n> Robert: Got to go now.\n\nThere was something in the desert.  \nThere was some place wild and green,  \nAnd a child in a village I passed through.  \nThere are places that I've traveled,  \nAnd so many things I've seen,  \nIt all fades away but you.\n\n(He drops a stack of negatives in the trashcan and sets them on fire. Then another pile of them as well. And a final stack of prints. As the song goes on, we may see the photographs he is discarding been projected on the screen.)\n\nI was sliding down a mountain,  \nI was burning in the sun,  \nI was crying with amazement at the view.  \nI was capturing a moment,  \nBut when all is said and done,  \nWell, it all fades away but you.  \nIt all fades away, it all fades away,  \nIt all fades away but you.\n\n(Robert packs his cameras into a card box and closes it.)\n\nI have sailed across the oceans,  \nPast the cities and the farms,  \nOn a never-ending quest for something new,  \nAnd the only things that mattered  \nWere the four days in your arms,  \n'Cause it all fades away but you.  \nIt all fades away, it all fades away,  \nIt all fades away but you.\n\n(As the mandolin plays, Robert sings along, holding one last photograph. Finally, he puts it in the box and seals it.)\n\nThere is one thing that's eternal,  \nThat cannot be torn apart,  \nThere is one thing that remains forever true.  \nPast the thinking, past the breathing,  \nPast the beating of my heart,  \nIt will all fade away but you.  \nIn all fades away, it all fades away,  \nIt all fades away but you.  \nIn all fades away, it all fades away,  \nIt all fades away but you.  \nBut you.  \nBut you.  \nYou.\n\n## Scene 6: The Bridge\n\n----------\n\n> Robert:  \nYou and I  \nAre just one second.  \nSpinning by  \nIn one split-second.  \nYou and I  \nHave just one second  \nAnd a million miles to go.\n"}