{"id":"ohsl6xw9pw","title":"ToddScene","content":"# Scene 36\n## INT. ARMITAGE GUNS AND AMMO - STORE - DAY\n\n(MACY enters the store with a clipboard of the seniors' paperwork.)\n\n(Todd is in front of a group of WOMEN, all different ages. The WOMEN all don PINK shirts with BREAST CANCER AWARENESS logos on the back and \"RE-ELECT JANE NEILSEN FOR STATE ASSEMBLY\" on the front, with the pithy motto \"NO JANE NO GAIN.\")\n\n(Todd has finished teaching a gun safety class; in his element here, confident, passionate about gun safety; a stand-up guy. Macy watches Todd's performance; tries not to roll her eyes.)\n\n> Todd: Ok, ladies. I want you to latch your safety and holster your weapon. And, please, on the way out take a look at the new merchandise-- I just got a shipment of Jupiter Arms for Women. Lightweight, fits in your purse, and with every purchase I'll throw in a box of pink bullets!\n\n(Women applaud. ASSEMBLY WOMAN JANE NEILSEN, 40's - half Cuban-American, no accent - is there, leading the group.)\n\nJane: Todd, thank you so much. These ladies have all beaten cancer, and I told them it was high time they learned to protect the life they fought so hard to keep.\n\n(Todd sees Macy. A tense glance. JANE NOTICES.)\n\n> Todd: It's been my honor, Assemblywoman. I hope to see you all at the Queen Fur opening ceremony tomorrow night. And let's remind everyone to think pink. Awareness is prevention.\n\n(The ladies disperse to shop.)\n\nMacy: (mouths words to Todd) We need you to sign.\n\n(Todd gives her an emphatic \"one minute\" gesture as Jane buttonholes Todd.)\n\nJane: Todd, thank you again.\n\n> Todd: Of course. Do you think we could talk privately for one minute?\n\n(Wanting to wriggle out of a private confab--)\n\nJane: (gestures to Macy) I think your employee is waiting for you.\n\n> Todd: In a way, Jane, she works for us, because she works for FLUGA.\n\nJane: Oh. You're sticking with that -- FLUGA?\n\n> Todd: (for the millionth time) Yes. Florida United Gun Association. We made patches Jane, and larger point is, the secessionist movement is gaining momentum now, and we can't ignore the groundswell. I've got guys with guns who are getting very itchy...\n\nJane: Todd, can I tell you something? I had a double mastectomy. I didn't want to. I had to grin and bear it. Sometimes we just have to do that, but there are rewards on the other side. Our ducks are not quite in a row, yet. (whispers) Soon. But not yet.\n\n(She takes his hand. Holds it to her chest in a kind of solidarity. Todd, uncomfortable, endures it. Then:)\n\nJane: Ladies, I've gotta hustle and get back to the business you have so kindly elected me to attend to. So, keep browsing and just bring merch to the cash register when you're ready and let's thank our darling Todd.\n\n## INT. VINTAGE CADILLAC / EXT. ARMITAGE GUNS AND AMMO - MOMENTS LATER\n\n(STEVE JUPITER, wealthy but slightly tacky, 50's sits in the caddy with his son CHESTER, 17, who sips a milkshake.)\n\n(Jane gets into the CADDIE and busses Steve on the cheek.)\n\nSteve: How'd it go?\n\nJane: Seamless. We're gonna sell a lot of guns. (beat) Hi Chester.\n\n(He waves sulkily.)\n"}