{"id":"waap3uuz8pn","title":"Diamonds","content":"# act 1\n\n(A shape appears on the balcony. the french windows rattle, then open. a darkly dressed figure enters wearing a balaclava over his head hiding his face. he glances cautiously around. does not see the body on the sofa.)\n\n> Jimmy: (Low voice) Hello? Anybody here? (Goes to the bedroom door and peers in) Hello?\n\nJimmy: (Goes to the suite door, opens it and peers out into the corridor. Leaves the door slightly ajar and returns. Takes off the balaclava and is revealed as a rather gormless looking character in his 30s. stealthily searches around, still without seeing the body. goes to the desk. puts the balaclava on the desk and opens drawers. finds a jewellery box. takes out a diamond necklace. holds it up to inspect it)\n\n> Jimmy: Aha! Yes!!\n(Stuffs it into his pocket. moves round the room again. comes across the body and leaps back)\nAhhh! (Peers) Ohhh! (Dithers) Er.... Oh....\n(Looks around wondering what to do. reaches forward to check if the body is really dead. at that moment the suite door is pushed open and adam bursts in. good looking actor type)\n(Jumping back) Ahhhh!\n\nAdam: Ahh! (Sees the body) Ohhhh! (Rushes forward and checks the body) You.... you bastard!\n\n> Jimmy: Me? No, no....\n\nAdam: You’ve killed her!\n\n> Jimmy: No, no–not me.\n\nAdam: You swine! She told me!\n\n> Jimmy: What?\n\nAdam: She rang my mobile, you bastard! She told me you were trying to kill her!\n\n> Jimmy: No, no, not me!\n\nAdam: Don’t try and deny it – look at you! Caught in the act!\n\n(He punches jimmy on the jaw and knocks him out cold)\n\n(... 6 pages of dialog ...)\n\nAdam: On the day of her premiere! Bastard!\n\n(JIMMY STIRS AND SITS UP)\n\nDon’t you move!\n\n> Jimmy: (DAZED) What’s happened?\n\nAdam: You’ve been rumbled, chum, that’s what’s happened. You’ve been caught red-handed at murder, and your mistress is implicated too!\n\n> Jimmy: (BEWILDERED)  My mistress?\n\n( ... )\n\nGrace: (INDICATING THE LUNCH TRAY) He must have put some in my lunch.\n\nAdam:  Proof! The bastard!\n\n(THREATENS JIMMY AGAIN, WHO COWERS AWAY)\n\n> Jimmy: No, no.\n\nAdam: (TO OSCAR) Call the police. We must have him arrested.\n\nOscar: Er.... yes.\n\n> Jimmy: No, please....\n\nAdam: But we can’t just let him go.  He tried to murder her!\n\n> Jimmy: No, no, I....\n\nAdam: And his mistress was in on it.\n\nGrace: His mistress?\n\nAdam: You were right.  She tried to stop him.  ‘H’.\n\nGrace: H?\n\n> Jimmy: H?\n\nAdam: Check your phone.  How can you deny it?\n\n> Jimmy: (LOOKS AT HIS PHONE) I, er....\n\nAdam: Well?  More proof!\n\n> Jimmy: That’s not... it’s just... I mean... I didn’t do anything.\n\nAdam: Didn’t do anything? You fed her peanuts! Knowing they were lethal for her.\n\n> Jimmy: No, I didn’t. It wasn’t me.\n\nAdam: I caught you. Standing right over her.\n\nGrace: You did?\n\nAdam: Yes. (TO HIM) Minutes after you called me.\n\n> Jimmy: Yes, but I... I....\n\nAdam: You were the only other person in the apartment. What were you doing if you weren’t trying to kill her?\n\nGrace: Yes, what were you doing?\n\nOscar: Yes, what were you doing?\n\n> Jimmy: (AT A LOSS) I was, um.... I was just....\n\nAdam: What? What?\n\n> Jimmy: Trying to save her.\n\n( ... )\n\nGrace: Help me up....\n\n(ADAM HELPS HER TO STAND UNSTEADILY)\nNow let me get this straight. (POINTS AT JIMMY) This is my secretive husband who supposedly was trying to poison me....\n\n> Jimmy: No, no....\n\n( ... )\n\nOscar: More or less.\n\nGrace: Intriguing.  (TURNS TO JIMMY)  And what was his motive for trying to murder me?\n\n> Jimmy: I didn’t.... I wasn’t....\n\nAdam: He claimed you had a lover.\n\nGrace: Really?\n\n> Jimmy: No, I didn’t!\n\n( ... )\n\nGrace: Not you.  You’re my agent.  (POINTS AT JIMMY)  With him.\n\n> Jimmy: Me?\n\n( ... )\n\nGrace: Out, out!\n\n(HAILEY HESITATES LOOKING AT JIMMY)\n\nHailey: Um....\n\nGrace: You too, sweetheart. You’ve delivered your non- message – thank you very much. Go and discuss press relations with my agent.\n\n(THEY ALL LEAVE RELUCTANTLY.  SHE TURNS TO FACE JIMMY)\n\n> Jimmy: Oh dear.\n\nGrace: Right, whoever you are – enlighten me as to what has happened here.\n\n> Jimmy: Oh God.\n\nGrace: No, he won’t help. In fact you may well feel his wrath if you can’t explain why you are posing as my husband who apparently tried to murder me.\n\n> Jimmy: I didn’t, I promise.\n\nGrace: Pose as my husband, or try to murder me?\n\n> Jimmy: Either – both.  I didn’t.\n\nGrace: No, I don’t think you did, but everyone else seems to think you did – so what’s it all about?\n\n> Jimmy: I, er.... It’s rather hard to explain.\n\nGrace: Then let me take a guess.  I know exactly who you are.\n\n> Jimmy: (APPREHENSIVE) You do?\nGrace: You’re the paparazzi.\n\n> Jimmy: Paparazzi?\n\nGrace: Think I can’t recognise a hack when I see one? I’ve had to put up with you lot dogging me all my life.  Didn’t follow all the others to the Carlton, but came here instead, didn’t you?  Well?\n\n> Jimmy: (SEEING A GLIMMER OF HOPE) Er.... that’s right.\n\nGrace: After a cheap story, aren’t you?  Sensational Cannes Festival scoop.  What a nerve!  How did you get into my suite?\n\n> Jimmy: I, er.... the door was unlocked.\n\nGrace: Was it indeed? Interesting. So you thought you’d just wander in and sniff around, eh? Thought you might have yourself an exclusive.\n\n> Jimmy: (APOLOGETIC)  That’s right.  I....\n\nGrace: Well you certainly stumbled on one, didn’t you? Discovered a star’s dead body on the sofa. Scoop of the year! Except I wasn’t quite dead.\n\n> Jimmy: Yes. I....\n\nGrace: Then what happened? Everyone arrived and you were caught with your pants down?\n\n> Jimmy: Well not exactly....\n\nGrace: And my leading man mistook you for my husband.\n\n> Jimmy: Yes.  Then your agent arrived....\n\nGrace: He’s not my agent - he’s my real husband, you fool.\n\n> Jimmy: Ah.\n\nGrace: And my incompetent manager, not my agent.  There’s a big difference.\n\n> Jimmy: (BEWILDERED)  Right.  So why did he....?\n\nGrace: Not admit to being my husband? That’s what I want to find out. Did he in fact try to poison me? Has he got a mistress? Is it that bimbo who just arrived?\n\n> Jimmy: Oh, I don’t think so.\n\nGrace: How would you know?\n\n> Jimmy: Well she.... I mean.... she doesn’t look the sort.\n\nGrace: On the contrary, she looks exactly the sort.\n\n> Jimmy: No, no....\n\nGrace: Why are you defending her?\n\n> Jimmy: Well, I just... I....\n\nGrace: One hell of a headline you’ve got unravelling here, haven’t you, chum? Which rag do you work for?\n\n> Jimmy: I, er.... I’m freelance.\n\nGrace: Well I’ll tell you what, Mr er.... What’s your name?\n\n> Jimmy: J... just call me Jimmy.\n\nGrace: Right, Jimmy. Here’s the deal. You use your journalistic skills – otherwise known as nose for dirt – to find out what my husband is up to, and I’ll refrain from having you prosecuted for breaking and entering, invasion of privacy, attempted murder, and whatever else my lawyers can think of. How does that sound?\n\n> Jimmy: How do I do that? \n\nGrace: How do you usually do it? You people must glean at least a faint semblance of fact on which you base your fairy stories. Snoop around. Dig up the dirt. Sniff out the scandal. BUT... you bring it to me before you give it to any of the papers. Understood?\n\n> Jimmy: Right.\n\nGrace: (PACING) Meanwhile I have to think how I’m going to play things from now on. If my husband did try to poison me....\n\n> Jimmy: Why would he do that?  A wonderful woman like you.\n\nGrace: Oh thank you. Well he doesn’t think I’m such a wonderful woman.\n\n> Jimmy: Why not?\n\nGrace: Familiarity breeds contempt – both ways.\n\n> Jimmy: Oh.\n\nGrace: He also knows I’m worth a lot of money, which currently all goes to him on my demise.\n\n> Jimmy: Ah.\n\nGrace: He also knows I’m allergic to peanuts.  He also, I suspect, has a mistress who he’d very much like to shack up with.\n\n> Jimmy: Oh dear...\n\nGrace: And that piece of hot totty posing as a secretary is a very likely candidate.\n\n> Jimmy: No, no – I don’t think it’s her.\n\nGrace: What do you know about such things? You look as if you’ve just learnt about the birds and the bees.\n\n> Jimmy: Well, I... Is that why he came back to the hotel? In case the press discovered you were dead?\n\nGrace: Possibly. Or to catch me with my lover.\n\n> Jimmy: Ah. Yes, he told me he thought you had a lover.\n\nGrace: Did he indeed? The pot calling the kettle black.\n\n> Jimmy: So that actor guy isn’t?\n\nGrace: Isn’t what?\n\n> Jimmy: Your lover.\n\nGrace: Of course he is.\n\n> Jimmy: Eh?\n\nGrace: Actresses always have affairs with their leading men.  It’s obligatory.\n\n> Jimmy: Wow. You show biz people!\n\nGrace: Don’t be silly. We’re no worse than anyone else. We just make more of a song and dance about it. Now – our problem is, how to explain your presence here, and how to get you access to my husband’s affairs without giving away what you’re up to.\n\n> Jimmy: Ah.\n\nGrace: If he finds out you’re a cheap hack he’ll have you for dinner.\n\n> Jimmy: Oh God.\n\nGrace: I know!\n\n> Jimmy: What?\n\nGrace: We’ll say the film company has taken you on to handle my publicity during the festival, and he has to find room for you in his production office. Perfect!\n\n> Jimmy: Publicity?\n\nGrace: It explains why you’re here, and you’ll be able to snoop around without anyone suspecting.\n\n> Jimmy: I don’t know anything about publicity.\n\nGrace: You know about newspapers, don’t you? Pretend to make some phone calls. Chat to your friends on the magazines. He’ll be glad to have you.\n\n> Jimmy: I don’t really think....\n\nGrace: Listen, sonny, you don’t have any choice in the matter. If you want to stay out of the clutches of the French police you’ll do what I want.\n\n> Jimmy: Well....\n\nGrace: And if you find out what my other half’s really up to then I’ll give you the scoop of your life. ‘Grace Gervaise’s husband arrested for attempted murder, fraud, bigamy, assault, and whatever else we can think of!\n\n> Jimmy: Has he done all those things?\n\nGrace: Who knows?  That arsehole’s capable of anything.\n\n> Jimmy: I don’t understand how he could treat you like that.\n\n( ... )\n\nOscar: You see! Resorting to toy-boys now!\n\n(MARCHES TO JIMMY AND KNOCKS HIM OUT WITH A PUNCH.) \n\n> Jimmy: (JIMMY COLLAPSES ONTO THE FLOOR AGAIN)\n\n( ... )\n\nGrace: What – you mean apart from being my lover who’s pretending to be my husband, who was trying to murder me?\n\nOscar: Oh, for God’s sake....!\n\n> Jimmy: (JIMMY GROANS AND WAKES UP)\n\nGrace: Poor Jimmy – are you all right?\n\nAdam: Well who is he?\n\nOscar: Yes, who is he?\n\nGrace: If you really want to know, he’s....\n\nOscar: No!  None of your stories - I want to hear it from him.\n\n(JIMMY SITS UP RUBBING HIS JAW)\n\n> Jimmy: I’m getting rather tired of this.\n\nOscar: (LEANING OVER HIM) Who are you and why were you canoodling with my wife?\n\n> Jimmy: I thought she was supposed to be my wife.\n\nOscar: (THREATENING HIM AGAIN) Don’t get clever with me! Well?\n\n> Jimmy: (JIMMY LOOKS AT GRACE, WHO SIGNALS FOR HIM TO SPEAK) I’m, er... I’m her new publicity agent.\n\nGrace: That’s right.\n\nOscar: What?\n\nGrace: The production company assigned him to look after me.\n\nOscar: A bit late. What’s he doing here?\n\n> Jimmy: I, er... came to talk to her.\n\n( ... )\n\nGrace: I took it out earlier because I was going to wear it. My necklace – given me by Prince Abdul. It’s gone! It’s... we’ve... someone’s taken it!\n\n(SHE GLARES ROUND THE ROOM)\n\nWho?\n\n(PAUSE.  EVERYONE IS FROZEN)\n\nIt must be somebody here.\n\nAdam: It could have been the staff.\n\nGrace: None of the staff have been in since lunch time.\n\n> Jimmy: (JIMMY SURREPTITIOUSLY TAKES THE NECKLACE FROM HIS POCKET AND DROPS IT INTO A WASTE BIN. GRACE HEARS THE SOUND AND TURNS. HE GAZES BACK AT HER INNOCENTLY)\n\n( ... )\n\nHailey: I wasn’t here then!\n\nGrace: Or my new publicity agent, who nobody knows anything about either, who’s in here nobody knows quite why, and who’s been in here nobody knows how long.\n\n> Jimmy: It wasn’t me.\n\nGrace: I don’t give a damn what Shakespeare wrote! My dogs are Rottweillers and I’m letting them loose on the lot of you.\n\nOscar: (MUTTERING) Oh God, she’s a nightmare!\n\n> Jimmy: (DITTO) The whole thing’s a nightmare.\n\n( ... )\n\nBoniface: So, I will leave the explication of all the identities for the moment - the first thing is to search everyone.\n\n> All: (PROTESTING) Oh no.... that’s not on.... you can’t demand that.... (ETC)\n\nBoniface: Please, monsieur.  I will decide who is likely. (TO JIMMY)  Monsieur.\n\n> Jimmy: (JIMMY EMPTIES HIS POCKETS)\n\nBoniface: Wallet, phone, handkerchief with lipstick....\n\n( ... )\n\nBoniface: (LOOKS AROUND. SEES JIMMY’S BALACLAVA ON THE DESK) What is this?\n\n> Jimmy: (STARTING TOWARDS HIM)  Um....\n\n( ... )\n\nBoniface: Whose is this?  (LOOKS AT JIMMY)  Yours monsieur.\n\nOscar: What?\n\nAdam: His?\n\nGrace: Yours?\n\n> Jimmy: (EVERYONE IS LOOKING AT JIMMY) Er... well... yes.\n\nGrace: How do you know the bimbo?\n\nHailey: (SIGHING) Ohh!\n\nGrace: Well?\n\n> Jimmy: I, er.... she’s a friend.\n\nOscar: A friend?\n\n> Jimmy: Well, a bit more than that.\n\nBoniface: How much more?\n\n> Jimmy: Well, my wife actually.\n\nGrace: Your wife??\n\n> Jimmy: Yes.\n\nOscar: (TO HAILEY)  His wife?\n\nHailey: Yes.\n\nGrace: The papar... I mean my publicity agent is married to the bim... I mean the secretary?\n\n> Jimmy: Yes.\n\nBoniface: How is this? I don’t understand. How does a husband and wife employ a wife and a husband without either husband and wife knowing about the other wife and husband?\n\n> Jimmy: Er.... coincidence?\n\nBoniface: I do not believe in coinsidences monsieur.  She is your accomplice!\n\n> Jimmy: Well, yes... in a manner of speaking.\n\nBoniface: What manner?\n\n> Jimmy: (TO GRACE) I’ll have to tell them.\n\nGrace: (RESIGNED) All right, tell them.\n\nOscar: What?\n\n> Jimmy: I’m not actually a publicity agent. As Madam Gervaise knows, I’m....\n\nGrace: Paparazzi.\n\nBoniface: Paparazzi?\n\nOscar: (TO GRACE)  He’s a journalist?\n\nGrace: Hack.\n\n> Jimmy: Yes. I’m, er... looking for good stories during the festival, and to help me my wife, er... went looking for jobs around the production offices....\n\nBoniface: Where she could find out the scandals!\n\n> Jimmy: Well... find where I might find the stars so I could find them and find....\n\nOscar: Cheap stories. That’s outrageous!\n\nGrace: Fell for it though, didn’t you, Mr Randy?\n\nOscar: What?\n\nGrace: She swanned in all tits and thighs, and you thought Christmas had come!  Bet you didn’t even ask for her credentials.\n\n> Jimmy: She has a degree in economics actually.\n\nGrace: Really?\n\nHailey: Honours degree.\n\nGrace: Goodness! Sex and statistics all in one package. (TO OSCAR) Lucky old you.\n\nOscar: Oh shut up!\n\nBoniface: So – your wife took a position with Monsieur Gervaise, so was able to inform you when Madame Gervaise was alone in the hotel, so you could invade her rooms and discover a celebrity story.\n\n> Jimmy: Er... something like that.\n\nBoniface: And perhaps steal celebrity sparklers also?\n\n> Jimmy: No!\n\nBoniface: (HOLDING UP THE BALACLAVA)  Is this balaclava hat yours?\n\n> Jimmy: No - never seen it before.\n\n( ... )\n\nAdam: On his phone.  It came through just after I caught him.  ‘Don’t do it.  Leave now.’\n\nBoniface: (LOOKING AT JIMMY’S PHONE)  That was on your phone, monsieur?\n\n> Jimmy: Er... yes.\n\nBoniface: What does it mean?\n\n> Jimmy: Well...\n\n( ... )\n\nBoniface: If this man is a journalist, why was he posing as Madame Gervaise’s publicity agent?\n\nOscar: Good point.\n\nBoniface: (TO JIMMY)  Well, monsieur?\n\n> Jimmy: I, er... didn’t want anyone to know I was a journalist.\n\n( ... )\n\nBoniface: We shall see. Secret affairs never stay secret for long. (TURNS TO JIMMY) You also, monsieur – you could have entered earlier and done all these crimes.\n\n> Jimmy: What – walked up to reception in a balaclava and said, ‘Please can you give me some of your peanuts and the key to Madame Gervaise’s room – I just want to pop in there to poison her and pinch all her jewellery’?\n\nGrace: I need to look beautiful for my public. All the cameras, all the fans, all the paparazzi, including my little friend here, will be there!\n\n> Jimmy: Yes, of course.\n\n# Act 2\n\n(THE SAME, LATE THAT EVENING. THE ROOM IS IN DARKNESS, LIT ONLY BY MOONLIGHT FROM THE FRENCH WINDOWS. A DARK FIGURE APPEARS ON THE BALCONY. PEERS IN, RATTLES THE FRENCH WINDOWS AND ENTERS. IT IS JIMMY IN HIS DARK CLOTHES AND BALACLAVA.)\n\n> Jimmy: (LOW VOICE)  Hello?  Anyone here?\n\n(TAKES OFF THE BALACLAVA, GOES TO THE WASTE BIN AND PEERS IN.  LIFTS IT UP AND SHAKES IT.  IT IS EMPTY)\n\nBugger!\n\n(LOOKS AROUND THE ROOM. AT THAT MOMENT THE SUITE DOOR BURSTS OPEN AND GRACE AND ADAM ENTER, SINGING AND DOING A TANGO TOGETHER. THEY ARE PRETTY SLOSHED. THEY TANGO AROUND THE SOFA AS JIMMY FLATTENS HIMSELF AGAINST THE WALL. AS HE SIDLES TOWARDS THE SUITE DOOR OSCAR AND HAILEY BURST IN, ALSO DOING A TANGO. JIMMY IS FORCED TO RETREAT. THE TWO COUPLES CIRCLE THE ROOM IN RIOTOUS FASHION, ONE OF THEM FLICKING ON THE LIGHTS AS THEY PASS. JIMMY COWERS BACK AGAINST THE WALL)\n\nAdam: Meryl Streep – time to retire!\n\nHailey: Wooooo!\n\n> Jimmy: (SHE SUDDENLY NOTICES JIMMY HIDING BY THE WALL. FRANTICALLY WAVES HIM TOWARDS THE DOOR, AT THE SAME TIME TWISTING OSCAR’S BACK TO HIM. JIMMY CREEPS TOWARDS THE OPEN DOOR)\n\nAdam: (ON THE PHONE)  Champagne please – two bottles to Grace Gervaise’s suite.\n\n(JUST AS JIMMY REACHES THE DOORWAY GRACE SEES HIM)\n\nGrace: Oh look, it’s our little paparazzi man! Following us around, are you, Jimmy boy?\n\n(JIMMY IS CAUGHT IN THE DOORWAY AS IF HE HAS JUST ARRIVED.  SHE WAVES HIM IN)\n\nCome in and join the party. We’re celebrating!\n\n> Jimmy: Er....\n\nOscar: The film is a success!\n\nAdam: The performance of Grace’s life!\n\nGrace: Yes!\n\nAdam: And mine too of course.\n\n> Jimmy: (HESITATING IN THE DOORWAY)  Oh, good.\n\nGrace: There’s your story, paparazzi man. Tell the world!\n\nAdam: Write the headlines!\n\nGrace: Come in, come in! Rescue your wife from my husband’s lecherous clutches.\n\n> Jimmy: Well, er.....\n\n(HE HIDES THE BALACLAVA BEHIND HIS BACK AND COMES BACK INTO THE ROOM)\n\n( ... )\n\nGrace: To hell with the lot of them! What do they know?\n\n> Jimmy: (HAILEY IS SIGNALLING QUESTIONS TO JIMMY. HE SHAKES HIS HEAD AND GESTURES HOPELESSLY. HIDES THE BALACLAVA BEHIND A SOFA CUSHION.)\n\n( ... )\n\nGrace: Why did you remind me? My beautiful necklace!\n\n> Jimmy: You, er... still haven’t found it?\n\n( ... )\n\nGrace: Have you written the story yet, Jimmy?\n\n> Jimmy: The story?\n\nGrace: The story of my attempted poisoning by my worthless husband.\n\nOscar: Oh for God’s sake!\n\nGrace: I thought it might be on tomorrow’s front pages.\n\n> Jimmy: Er, no, not yet.\n\nGrace: Why not?\n\n> Jimmy: I didn’t think you’d want it to, er....\n\n( ... )\n\nBoniface: Yours also I am sure, monsieur. What a night! What an honour for the Hotel Superb!\n\n(POURS CHAMPAGNE AND HANDS ROUND GLASSES.)\n\n> Jimmy: (JIMMY ASSISTS. OSCAR PASSES ONE TO ADAM. SOME CONFUSION OVER GLASSES AS EVERYONE IS INVOLVED)\n\nBoniface: Success after all the dramas, all the crises.  Let us drink to another triumph for Madame Gervaise, doyen of the cinema.\n\nOscar: If we must.\n\nBoniface: And to her brilliant manager of course.\n\nGrace: If we have to.\n\nBoniface: (RAISES GLASS) The Gervaises!\n\n> All: (RAISING GLASSES)  The Gervaises!\n\n( ... )\n\nBoniface: (MODESTLY)  Well actually the genius was my chambermaid.  She found it in the waste bin.\n\n> Jimmy: (IN DISGUST)  Ah!\n\n( ... )\n\nAdam: Perhaps he was the murderer.\n\nOscar: Would-be murderer.\n\nBoniface: Perhaps.  Who knows?\n\n> Jimmy: No!\n\nBoniface: What?\n\n> Jimmy: Why would he...? I mean, what would he...?  I mean, why would he try to murder someone before stealing their jewellery?\n\nHailey: That’s a good point.\n\n( ... )\n\nBoniface: Madame, monsieur! This is not the way for imminent show business people to behave. Especially in front of the press.\n\n> Jimmy: No, quite.\n\n( ... )\n\nGrace: (POINTING AT OSCAR) You! You were handing out the glasses.\n\nOscar: No!  (POINTING AT JIMMY)  Him!  He was helping.\n\n> Jimmy: No, no, not me!\n\nBoniface: We cannot leave him on the floor.  Carry him to the bedroom while I call the doctor.\n\nGrace: Yes, yes – put him on the bed.\n\n> Jimmy: (OSCAR AND JIMMY CARRY THE BODY INTO THE BEDROOM WITH HAILEY IN ATTENDANCE, AS BONIFACE SPEAKS ON THE HOTEL PHONE. ONLY GRACE IS WITH HIM)\n\n( ... )\n\nGrace: You despicable man! You pathetic lecher! You jealous hypocrite! You’ve murdered the love of my life!\n\nOscar: No! No!\n\n(SHE FIRES TWICE. OSCAR CRUMBLES TO THE FLOOR. BONIFACE STARES AGHAST.)\n\n> Jimmy:  (JIMMY AND HAILEY RUN IN)\n\nBoniface: Ah, mon dieu!\n\nHailey: What happened?\n\nBoniface: She has shot him! She has killed her husband!\n\n> Jimmy: (GOING TO OSCAR) Oh my God! (TO GRACE) What have you done?\n\nGrace: Now you’ve got a real story, paparazzi man. It’s your lucky day. Two celebrity murders to write about.\n\nBoniface: But Madame, what were you thinking?\n\nGrace: He deserved it. He had it coming. He poisoned my leading man – out of pure jealousy!\n\n> Jimmy: You don’t know it was him.\n\n( ... )\n\nBoniface: Uh! Such theatrics. (WIPES HIS BROW) I don’t know if I’m going or coming. My head is spinning. (WAVES AT THE PHONE) Someone please tell reception to stop the doctor coming. We don’t want any more witnesses to this fiasco!\n\nHailey: I’ll do it.\n\n> Jimmy: (HAILEY GOES TO SPEAK ON THE PHONE. ON THE WAY SHE SIGNALS TO JIMMY AND POINTS AT THE NECKLACE ON THE TABLE WHERE GRACE HAS LEFT IT)\n\nBoniface: (APOLOGETIC) I did not say because I was still trying to solve the rest of the mystery. I was trying to discover which of you crazy peoples was where and who knew what and who did what to who. I am sorry.\n\n> Jimmy: (HAILEY PUTS DOWN THE PHONE. JIMMY HAS STEALTHILY MOVED CLOSE TO NECKLACE. HE SIGNALS TO HER)\n\n( ... )\n\nBoniface: Don’t be absurd, monsieur! There isn’t enough poison in France for another one!\n\n> Jimmy: (AS THEY CROWD ROUND HAILEY, JIMMY QUIETLY GRABS THE NECKLACE, NIPS TO THE FRENCH WINDOWS, OPENS THEM, HOOKS THE NECKLACE ONTO THE OUTER HANDLE, AND CLOSES THEM AGAIN. THEN HE RETURNS TO HAILEY)\n\nBoniface: Ma’mselle, can you hear me? Ma’amselle bimbo?\n\nGrace: Get the doctor back.\n\n> Jimmy: No, it’s all right. Keep back please, everyone.\n\nBoniface: What?\n\n> Jimmy: I know what’s wrong.\n\nGrace: You do?\n\n> Jimmy: It’s a panic attack.\n\nBoniface: Panic attack?\n\n> Jimmy: (KNEELING BESIDE HER)  She gets them sometimes.\n\nIt’s all the excitement.\n\n(HE PATS HER CHEEKS)\n\nWake up, Hailey, wake up.  It’s all right.  I’m here.\n\n(HE MASSAGES HER HANDS)\n\nWake up.\n\nHailey: (STIRRING) Oh! (SITS UP) What happened?\n\n> Jimmy: You’ve drunk too much. You’ve had one of your attacks. But it’s all right.\n\nHailey: (WEAK VOICE)  So many murders... and guns.... and poisons....\n\n> Jimmy: Yes, but nobody’s died.  We’re all here. Everything’s all right.\n\nHailey: You promise?\n\n> Jimmy: Yes, yes.\n\nOscar: This is beyond a joke!\n\nAdam: Hear, hear.\n\nBoniface: I agree, monsieur. Does anyone else wish to pass out before we continue? Heart attach perhaps? Brain seizure anyone?\n\n> Jimmy: I’m so sorry. She’s all right now. Aren't you , Hailey?\n\n(HE HELPS HER GET TO HER FEET)\n\nHailey: Yes, yes, I’m fine.\n\n> Jimmy: It won’t happen again.\n\n( ... )\n\nBoniface: The waste bin.  (UPENDS IT)  Nothing.\n\nGrace: (POINTING AT JIMMY AND HAILEY)  You two!  It must have been you two.\n\n> Jimmy: Us?  How?\n\nHailey: I was unconscious.\n\n> Jimmy: I was attending to her.\n\nBoniface: (SHRUGGING) They are so clever these Riviera thieves. They have such tricks. Maybe this time they somehow.... What do you think, Mr Paparazzi man?\n\n> Jimmy: It’s a mystery.  What do you think, Hailey?\n\n( ... )\n\nGrace: (OFFHAND)  It doesn’t really matter.  It wasn’t worth anything anyway.\n\nOscar: What do you mean?\n\nGrace: It wasn’t the real necklace.  It was a replica.\n\n> Jimmy: What?\n\nHailey: What?\n\nGrace: I never wear the real thing – it’s too valuable.\n\nBoniface: It wasn’t...!  Where is the real one?\n\nGrace: In your hotel safe, Monsieur Boniface.  Where I trust it’s really safe.  Unless your chef has access to it.\n\n> Jimmy: (GASPS OF INCREDULITY ALL ROUND. JIMMY AND HAILEY ROLL EYES AT EACH OTHER)\n\n( ... )\n\nAdam: (UNENTHUSIASTICALLY) All right. Oscar, tell the company what you did when I collapsed?\n\n> Jimmy: (WHILE THE FOCUS IS ON OSCAR, JIMMY SIGNALS TO HAILEY, WHO EDGES TOWARDS THE FRENCH WINDOWS)\n\n( ... )\n\nGrace: All right. Now the paparazzi man and his bimbo.\n\nHailey: Ohh!\n\n> Jimmy: Please stop calling my wife a bimbo.\n\nGrace: Sorry. The paparazzi man and his totty.\n\nHailey: Uh!\n\nAdam: (TO JIMMY) Well? What were your movements?\n\n> Jimmy: (INDICATING OSCAR) Well, the same as his. We helped carry you in there. We didn’t come back until the shots.\n\nGrace: Ah, but then what?\n\n> Jimmy: Well, we.... we....\n\n( ... )\n\nGrace: I think little Jimmy and his pretty partner can tell us.\n\n(EVERYONE STARES AT THE PAIR)\n\nBoniface: Eh?\n\nOscar: What?\n\n> Jimmy: Us?\n\nGrace: Yes, you, you pseudo paparazzi man. You clever pair of innocents. You’re no journalist. She’s no secretary. You’re the Riviera jewel thieves, aren’t you?\n\nHailey: Us?\n\nGrace: You think you can pull the wool over my eyes? Me, the expert on every convoluted film plot ever written? The star of half the crime melodramas ever made? I rumbled you two the moment you met here.\n\nBoniface: Is this true?  You are the Riviera jewel thieves?\n\n> Jimmy: (BASHFUL) Well.... I suppose there’s no point in denying it now.\n\nOscar: Good God!\n\nAdam: Bloody hell!\n\nGrace: Leaving my necklace in the waste bin – really!\n\n> Jimmy: (SHRUGGING)  There was nowhere else.\n\nGrace: (TO HAILEY) That pathetic stage faint – huh!\n\nHailey: It fooled all of them.\n\nGrace: I’ve seen better ones in a Punch and Judy show. Tell me, are you two actually married?\n\nHailey: No.\n\n> Jimmy: We’re just partners.\n\n( ... )\n\nGrace: (TO THEM)  Replaced it after I told you it wasn’t worth anything, didn’t you?\n\n(THEY SHRUG)\n\nVery neat.  However, a big mistake.\n\n> Jimmy: Why?\n\nGrace: I was lying. It is in fact the real one.\n\nHailey: What??\n\nGrace: I decided I wanted the real thing for the premiere tonight, so I asked the receptionist to take it from the hotel safe this morning and leave the fake one in its place.\n\n> Jimmy: Uh...\n\n( ... )\n\nAdam: (CLAPPING) Hurrah! All friends again.\n\n> Jimmy: (JIMMY AND HAILEY JOIN IN THE APPLAUSE.)\n\n"}