{"id":"zm637bhakh","title":"DiamondsAdam","content":"# Act 1\n\nJimmy: Aha! Yes!!\n(Stuffs it into his pocket. moves round the room again. comes across the body and leaps back)\nAhhh! (Peers) Ohhh! (Dithers) Er.... Oh....\n(Looks around wondering what to do. reaches forward to check if the body is really dead. at that moment the suite door is pushed open and adam bursts in. good looking actor type)\n(Jumping back) Ahhhh!\n\n> Adam: Ahh! (Sees the body) Ohhhh! (Rushes forward and checks the body) You.... you bastard!\n\nJimmy: Me? No, no....\n\n> Adam: You've killed her!\n\nJimmy: No, no–not me.\n\n> Adam: You swine! She told me!\n\nJimmy: What?\n\n> Adam: She rang my mobile, you bastard! She told me you were trying to kill her!\n\nJimmy: No, no, not me!\n\n> Adam: Don't try and deny it – look at you! Caught in the act!\n\n(He punches jimmy on the jaw and knocks him out cold)\n\nBastard!\n\n(GOES TO THE BODY AND KNEELS BESIDE IT)\n\nMy darling.... What has he done to you? Speak to me. Oh my God, she's dead!\n\n(OSCAR APPEARS IN THE OPEN DOORWAY. SLEEK BUSINESS TYPE)\n\nOscar: Hey!\n\n> Adam: (LEAPING UP) Oh!\n\nOscar: What the....? What's going on?\n\n> Adam: Who are you?\n\nOscar: I'm.... Who are you?\n\n> Adam: I'm.... er....\n\nOscar: (SEEING THE BODY) Oh my God! What's happened?\n\n> Adam: It's Grace Gervaise. She's dead. She's been murdered.\n\nOscar: Murdered?\n\n> Adam: By her husband.\n\n(A BEAT)\n\nOscar: Her husband?\n\n> Adam: Yes. (POINTS AT JIMMY) There.\n\nOscar: That's her husband?\n\n> Adam: Yes.\n\nOscar: Is he dead too?\n\n> Adam: No. I just punched him.\n\nOscar: (DITHERING) Why? What? Who....? I don't understand.\n\n> Adam: I got a desperate call on my mobile. She said her husband was trying to kill her. And I rushed over and found her like this.\n\nOscar: Kill her – how?\n\n> Adam: Poison, she said.\n\nOscar: Poison?\n\n> Adam: Yes.\n\nOscar: She said her husband?\n\n> Adam: Well someone. Most likely her husband. They detest each other.\n\nOscar: Do they? (ADAM NODS) And.... that's her husband?\n\n> Adam: Yes. He was standing right over her. I've never met him, but I know he's a shit.\n\nOscar: (INDIGNANT) A shit! Who told you that?\n\n> Adam: She did.\n\nOscar: Who are you?\n\n> Adam: I'm.... er....\n\nOscar: I know you! You're that actor. In her film.\n\n> Adam: Er... yes.\n\nOscar: (CAUTIOUSLY) Of course! So you must be....\n\n> Adam: Who are *you*?\n\nOscar: Me?\n\n> Adam: Yes.\n\nOscar: I'm, er....\n\n> Adam: Yes?\n\nOscar: Her agent.\n\n> Adam: Her agent?\n\nOscar: Yes.\n\n> Adam: Ah! You're\nhere for the premiere?\n\nOscar: Exactly. I\njust came round to, er.... Tell me....\n\n> Adam: What?\n\nOscar: Why did she\ncall you?\n\n> Adam: Well, I.... she.... I was the first person she thought of.\n\nOscar: Why?\n\n> Adam: Well I was working with her. I'm in the next hotel....\n\nOscar: The Carlton?\n\n> Adam: Yes. I rushed straight over.\n\nOscar: (FIERCE) You're her lover, aren't you?\n\n> Adam: What?\n\nOscar: I know she has a lover. You're him.\n\n> Adam: Nonsense! I'm just a friend. Working with her.\n\nOscar: Well if you aren't.... (TURNS TO JIMMY) He must be.\n\n> Adam: That's her husband.\n\nOscar: Ah, yes.  (TURNS BACK)  Then it has to be you.\n\n> Adam: Me what?\n\nOscar: Her lover.\n\n> Adam: No, I told you, I.... How do you know she has a lover?\n\nOscar: I just know.\n\n> Adam: What's it to you anyway?\n\nOscar: What?\n\n> Adam: You're just her agent.\n\nOscar: Yes, well.... I have to protect my assets.\n\n> Adam: You haven't protected her very well. (GOES TO THE BODY)\n\nOh, poor Grace.... (TURNS ON JIMMY) You bastard!\n\n(KICKS HIM.  JIMMY GROANS AND STIRS)\n\nOscar: You're sure that's her husband?\n\n> Adam: Who else could it be? Grace was afraid he'd try something.\n\nOscar: How do you know?\n\n> Adam: She told me. Bastard! (KICKS JIMMY AGAIN)\n\nOscar: Steady on. Don't kill him.\n\n> Adam: We must call the police.\n\nOscar: (HESITATING) Ah. Well, er....\n\n> Adam: Or perhaps the management.\n\nOscar: Yes. Er.... Hang on a moment.... (THINKS)\n\n> Adam: What are you waiting for? We must do something!\n\nOscar: Yes, but....\n\n> Adam: That's his phone! (GOES TO JIMMY AND TAKES HIS MOBILE FROM HIS POCKET) Message. 'Don't do it. Leave now.' There! Proof!\n\nOscar: Who's it from?\n\n> Adam: 'H'. Who's H?\n\nOscar: I don't know.\n\n> Adam: I can guess.\n\nOscar: Who?\n\n> Adam: Someone who was in on the plot. His mistress!\n\nOscar: His mistress?\n\n> Adam: He has a mistress. She told me.\n\nOscar: She told you that?\n\n> Adam: Yes.\n\nOscar: She told you an awful lot.\n\n> Adam: Well we've been working together. Closely.\n\nOscar: Very closely. How did she know?\n\n> Adam: What?\n\nOscar: That her husband has a mistress!\n\n> Adam: She suspected. Bastard! A wonderful woman like Grace. That's his motive of course.\n\nOscar: 'Don't do it – leave now.' Why would his mistress send a message like that?\n\n> Adam: I dunno. Perhaps they planned it together.\n\nOscar: Her murder?\n\n> Adam: They planned to kill Grace and run off together. Then perhaps she got cold feet. She was telling him not to kill Grace, but just to leave her now.\n\nOscar: Leave her?\n\n> Adam: On the day of her premiere! *Bastard*!\n\n(JIMMY STIRS AND SITS UP)\n\nDon't you move!\n\nJimmy: (DAZED) What's happened?\n\n> Adam: You've been rumbled, chum, that's what's happened. You've been caught red-handed at murder, and your mistress is implicated too!\n\nJimmy: (BEWILDERED)  My mistress?\n\n> Adam: How could you? A fabulous woman like Grace! Murdered!\n\nOscar: Are you sure she's dead?\n\n> Adam: Of course she is.  (GOES TO THE BODY)  She was already passing out when she phoned me, and....\n(FEELS HER PULSE. SHE STIRS AND MOANS. HE LEAPS BACK)\nOh my God!\n\nOscar: Oh my God!\n\n> Adam: Grace?\n\nGrace: (PAUSE. SHE SITS UP GROGGILY. NOT YOUNG BUT STILL GLAMOROUS FILM STAR) (DAZED) What happened?\n\n> Adam: Grace! You're not dead!\n\nGrace: I don't think so. (LOOKS UP)  Adam!  What are you...?\n\n> Adam: You called me.\n\nGrace: Oh yes. I.... (SEES OSCAR AND JUMPS) Ah!\n\nOscar: Grace.\n\nGrace: Why are you....? (SEES JIMMY AND JUMPS AGAIN) Ah!!\n\n> Adam: It's all right. I caught him.\n\nGrace: Caught who?\n\n> Adam: (INDICATING JIMMY) Your husband. Red-handed.\n\nGrace: My husband?\n\n> Adam: Yes. (INDICATING OSCAR) And he's a witness - your agent.\n\nGrace: My agent?\n\n> Adam: We'll put him away for life!\n\nGrace: (FROWNING) I, er....\n\n> Adam: How are you feeling?\n\nGrace: All right, I think. I must have collapsed. (WAVERS BETWEEN THE OTHER TWO) Who, er....? Why, er....?\n\n> Adam: Take it easy.  You're confused.\n\nGrace: I'm not sure what's happened here.\n\n> Adam: Someone tried to poison you – your husband probably - and you called me before you passed out.\n\nGrace: Ah, yes.\n\n> Adam: How did he do it?\n\nGrace: Do it?\n\n> Adam: Poison you.\n\nGrace: Peanuts.\n\n> Adam: Peanuts?\n\nGrace: He knows I'm allergic.\n\n> Adam: Ah, yes.\n\nGrace: (INDICATING THE LUNCH TRAY) He must have put some in my lunch.\n\n> Adam: Proof! The bastard!\n\n(THREATENS JIMMY AGAIN, WHO COWERS AWAY)\n\nJimmy: No, no.\n\n> Adam: (TO OSCAR) Call the police. We must have him arrested.\n\nOscar: Er.... yes.\n\nJimmy: No, please....\n\n> Adam: Caught in the act. You'll get life for this!\n\nGrace: Just a minute.\n\n> Adam: What?\n\nGrace: Let's think about it.\n\n> Adam: What's there to think about? It's attempted murder. We're all witnesses.\n\nGrace: Yes, but er....  Well, is it wise?\n\n> Adam: Wise?\n\nGrace: The publicity....\n\n> Adam: Ah.\n\nOscar: Yes, quite!  The publicity.\n\nGrace: The middle of the Cannes Film Festival...\n\nOscar: Grace all over the headlines.\n\n> Adam: Yes.\n\nOscar: Not a good idea.\n\n> Adam: But we can't just let him go.  He tried to murder her!\n\nJimmy: No, no, I....\n\n> Adam: And his mistress was in on it.\n\nGrace: His mistress?\n\n> Adam: You were right.  She tried to stop him.  'H'.\n\nGrace: H?\n\nJimmy: H?\n\n> Adam: Check your phone.  How can you deny it?\n\nJimmy: (LOOKS AT HIS PHONE) I, er....\n\n> Adam: Well?  More proof!\n\nJimmy: That's not... it's just... I mean... I didn't do anything.\n\n> Adam: Didn't do anything? You fed her peanuts! Knowing they were lethal for her.\n\nJimmy: No, I didn't. It wasn't me.\n\n> Adam: I caught you. Standing right over her.\n\nGrace: You did?\n\n> Adam: Yes. (TO HIM) Minutes after you called me.\n\nJimmy: Yes, but I... I....\n\n> Adam: You were the only other person in the apartment. What were you doing if you weren't trying to kill her?\n\nGrace: Yes, what were you doing?\n\nOscar: Yes, what were you doing?\n\nJimmy: (AT A LOSS) I was, um.... I was just....\n\n> Adam: What? What?\n\nJimmy: Trying to save her.\n\n> Adam: Don't give me that! She phoned me on the point of collapse. You were trying to poison her with crushed peanuts or peanut oil, or.... (POINTS AT THE TRAY) The forensics will find it and you'll be hung, drawn and quartered!\n\nOscar: You seem very concerned for someone who's just a fellow actor.\n\n> Adam: Of course! She nearly died.\n\nGrace: At least someone's concerned.\n\n> Adam: Quite. You're her agent – aren't you concerned?\nOscar: Well naturally.  But she's all right now.  It can't have been a very serious attempt.\nGrace: Oh, thank you very much. That's all right then.\nOscar: No, I didn't mean...\n\nGrace: Help me up....\n\n(ADAM HELPS HER TO STAND UNSTEADILY)\nNow let me get this straight. (POINTS AT JIMMY) This is my secretive husband who supposedly was trying to poison me....\n\nJimmy: No, no....\n\n> Adam: You told me he was.\n\nGrace: (POINTING AT OSCAR)  And this is my aspiring agent...\n\n> Adam: Aspiring?\n\nGrace: ...who miraculously arrived on the scene at the same time.\n\nOscar: Not quite.\n\nGrace: And who apparently corroborates your story.\n\n> Adam: (TO OSCAR)  Well you do, don't you?\n\nOscar: (HESITATING)  Er....\n\nGrace: Well?\n\nOscar: More or less.\n\nGrace: Intriguing.  (TURNS TO JIMMY)  And what was his motive for trying to murder me?\n\nJimmy: I didn't.... I wasn't....\n\n> Adam: He claimed you had a lover.\n\nGrace: Really?\n\nJimmy: No, I didn't!\n\n> Adam: No. (POINTS AT OSCAR) He claimed you had a lover.\n\n( ... )\n\nGrace: Don't tell me you haven't had lovers.\n\nOscar: That's different, I....\n\nGrace: Oh, I see – one rule for agents and another for clients!\n\nOscar: Not at all.  I....\n\n> Adam: I don't quite understand. Something odd is going on here....\n\nOscar: You'd better keep quiet, you.\n\nGrace: He's every right to speak.\n\nOscar: What – as both your leading man and stand-in at the same time, eh?\n\nGrace: He's nothing of the sort, and it's nothing to do with my agent anyway.\n\nOscar: (CONTAINING HIMSELF)  Grrrr!\n\nGrace: If you want to remain my agent you'd better stay out of this.\n\n> Adam: Yes, quite.\n\n( ... )\n\nHailey: I put them off the trail. (POINTING TO ADAM) I sent them to his hotel instead.\n\n> Adam: (PREENING)  Oh thank you.\n\nGrace: Not you.  You're my agent.  (POINTS AT JIMMY)  With him.\n\nJimmy: Me?\n\nGrace: Would the rest of you kindly go next door to the bedroom and do whatever you like to do in bedrooms, while I and my 'husband' have a talk. You can discuss the situation and pretend it's all part of Murder In The Dark.\n\n(THEY ALL STARE AT HER)\n\nGo on – shoo!\n\n> Adam: Grace, I....\n\nGrace: Out.\n\nOscar: Look here, Grace....\n\nGrace: Out, out!\n\n(HAILEY HESITATES LOOKING AT JIMMY)\n\nHailey: Um....\n\nGrace: You too, sweetheart. You've delivered your non- message – thank you very much. Go and discuss press relations with my agent.\n\n> All: (THEY ALL LEAVE RELUCTANTLY.  SHE TURNS TO FACE JIMMY)\n\n( ... )\n\nOscar: You see! Resorting to toy-boys now!\n\n(MARCHES TO JIMMY AND KNOCKS HIM OUT WITH A PUNCH. JIMMY COLLAPSES ONTO THE FLOOR AGAIN)\n\nGrace: Oh, poor boy!\n\nOscar: Hah!\n(ADAM ENTERS)\n\n> Adam: What's happening?\n\nOscar: I caught them – practically having it off!\n\n> Adam: What??\n\nOscar: He's her lover. I knew all along!\n\n> Adam: I thought he was her husband?\n\nOscar: Don't be fatuous – of course he's not. I am.\n\n> Adam: You? But I thought....\n\nGrace: (TENDING TO JIMMY) Oh shut up, both of you!\n\n> Adam: I don't understand. This man's your lover?\n\nOscar: Yes! Putting your nose out of joint, eh?\n\n> Adam: (TO OSCAR) And you're her...?\n\nOscar: Yes, yes – her very long, very suffering husband. Now shut up!\n\nGrace: You clowns! The poor boy should have you both for grievous bodily harm!\n\nOscar: So what is he doing here?\n\nGrace: What – you mean apart from being my lover who's pretending to be my husband, who was trying to murder me?\n\nOscar: Oh, for God's sake....!\n\nJimmy: (JIMMY GROANS AND WAKES UP)\n\nGrace: Poor Jimmy – are you all right?\n\n> Adam: Well who is he?\n\n( ... )\n\nGrace: (POINTING AT ADAM)  I thought he was my stud.\n\nOscar: I never know with you! Anything in trousers it seems.\n\nGrace: How dare you!\n\n> Adam: Yes, how dare you! Speaking of your wife like that.\n\nOscar: (SQUARING UP) I'll speak of my wife how I want! It's none of your business.\n\n> Adam: (ALSO SQUARING UP)  It's my business if someone insults my leading lady!\n\nOscar: Oh yes?\n\n> Adam: (NOSE TO NOSE)  Yes.\n\nOscar: Oh yes?\n\n> Adam: Yes!\n\nGrace: Pathetic!  Cut it out boys.  Save it for the playground.\n\nOscar: Grrrr!\n\n> Adam: Grrrr!\n\n(THEY BREAK APART. HAILEY ENTERS)\n\n( ... )\n\nGrace: I took it out earlier because I was going to wear it. My necklace – given me by Prince Abdul. It's gone! It's... we've... someone's taken it!\n\n(SHE GLARES ROUND THE ROOM)\n\nWho?\n\n(PAUSE.  EVERYONE IS FROZEN)\n\nIt must be somebody here.\n\n> Adam: It could have been the staff.\n\nGrace: Who, if he's up to murder, is probably up to theft as well....\n\nOscar: Ludicrous!\n\nGrace: My leading man, who's earning almost as much as I am, but has big tax problems....\n\n> Adam: Absurd!\n\nGrace: And who got here from his hotel remarkably quickly....\n\n> Adam: Well of course I did!\n\n( ... )\n\nGrace: No? Well then, so be it. (PROCLAIMS) 'Once more unto the breach, and let loose the hounds of war!'\n\n> Adam: Dogs.\n\nGrace: What?\n\n> Adam: Dogs of war.  That's what Shakespeare wrote.\n\n( ... )\n\nBoniface: So, I will leave the explication of all the identities for the moment - the first thing is to search everyone.\n\n> All: (PROTESTING) Oh no.... that's not on.... you can't demand that.... (ETC)\n\n( ... )\n\nBoniface: Enough! (PATS DOWN OSCAR) Thank you, monsieur. Please stand aside. Now, the actor. (INDICATES ADAM) This one, yes?\n\nGrace: Yes.\n\nBoniface: Please monsieur.\n\n> Adam: (RELUCTANTLY)  I object to this.\n(EMPTIES HIS POCKETS)\n\nBoniface: Wallet, phone, handkerchief with lipstick....\n\nOscar: Hah!\n\nBoniface: ....packet of unmentionables. Small size.\n\nOscar: (TO GRACE)  Now who's the pot calling the kettle black?\n\nGrace: Nothing to do with me.\n\nOscar: (THREATENING ADAM)  Well I can't think what else they're for.\n\n> Adam: Emergencies – just like you.\n\n( ... )\n\nBoniface: Please, monsieur.  I will decide who is likely. (TO JIMMY)  Monsieur.\n\nJimmy: (JIMMY EMPTIES HIS POCKETS)\n\nBoniface: Wallet, phone, handkerchief with lipstick....\n\n> All: Aha!\n\n( ... )\n\nBoniface: Perhaps.  So now we try the actor's. (PRESSES BUTTONS.  GRACE'S PHONE ON THE DESK BUZZES) Aha!  Madame's phone, yes?\n\nOscar: I knew it! He's her lover!\n\n> Adam: Nonsense! I was....\n\nOscar: What?\n\n> Adam: Trying to call her back after she passed out.\n\n( ... )\n\nBoniface: Whose is this?  (LOOKS AT JIMMY)  Yours monsieur.\n\nOscar: What?\n\n> Adam: His?\n\n( ... )\n\nBoniface: So – your wife took a position with Monsieur Gervaise, so was able to inform you when Madame Gervaise was alone in the hotel, so you could invade her rooms and discover a celebrity story.\n\nJimmy: Er... something like that.\n\nBoniface: And perhaps steal celebrity sparklers also?\n\nJimmy: No!\n\nBoniface: (HOLDING UP THE BALACLAVA)  Is this balaclava hat yours?\n\nJimmy: No - never seen it before.\n\n> Adam: Just a minute!\n\nBoniface: What?\n\n> Adam: (TO HAILEY) What's your name?\n\nHailey: Hailey.\n\n> Adam: Aha! H! The message was from you.\n\nBoniface: What message?\n\n> Adam: On his phone.  It came through just after I caught him.  'Don't do it.  Leave now.'\n\n( ... )\n\nJimmy: I, er... didn't want anyone to know I was a journalist.\n\nOscar: Because.... (INDICATING ADAM) I found him here, and he didn't know I was her husband, and I wanted to find out what he was doing here.\n\n> Adam: Oh, really?\n\nOscar: Yes, really.\n\n> Adam: Grrrr!\n\n( ... )\n\nBoniface: (PROCLAIMING) And finally - when everybody got here to the hotel, which one arrived wearing a balaclava hat, in time to put poison in Madame Gervaise's Caesar Salad??\n\nGrace: Yes. Who?\n\n> All: (EVERYONE LOOKS AT EVERYONE ELSE)\n\nBoniface: Of course the answer is...\n\nGrace: What?\n\nOscar: What?\n\n> Adam: What?\n\n( ... )\n\nBoniface: Yes, that's everyone.  And peanuts are easy to acquire.\n\nGrace: From your bar!\n\nBoniface: From anyone's bar. (TO ADAM) Yours for instance.\n\n> Adam: Ridiculous!\n\nBoniface: Why?\n\n> Adam: I'm her l... leading man. I'm completely innocent.\n\nBoniface: Nobody is innocent, monsieur, until I have found them not guilty.\n\n> Adam: You aren't the law here, Monsieur Boniface.  We should have called the police – I said so in the first place.\n\nBoniface: We do not need the police until I, Hercule Poirot of the Riviera, have discovered the culprits.  Then we will decide how to handle the situation. Now – Madame Gervaise.\n\nGrace: Yes?\n\nBoniface: What time did your husband leave this morning for his office?\n\nGrace: About nine oclock.\n\nBoniface: Too early to put peanuts in your salad.\n\n> Adam: Unless he nipped back later in his balaclava.\n\n( ... )\n\nBoniface: Monsieur actor.\n\n> Adam: Yes?\n\nBoniface: Where were you this morning before you got the call for help from Madame Gervaise?\n\n> Adam: At my hotel – eating peanuts.\n\nBoniface: Why aren't you staying at this hotel?\n\n> Adam: Because that's a better hotel.\n\nBoniface: (INDIGNANT)  There is no better hotel in Cannes than this hotel!\n\nOscar: I'll tell you why. Because it would be too obvious he was having an affair with my wife if he stayed at the same hotel.\n\nBoniface: Is this true?\n\n> Adam: Certainly not!\n\nBoniface: But you could have come to this hotel earlier, with your peanuts, wearing the balaclava hat, poisoned Madame Gervaise's salad, and stolen her necklace at the same time.\n\n> Adam: That's nonsense!  If I'm having an affiar with her, why would I want to poison her?\n\n( ... )\n\nBoniface: Either one of these monsieurs, or madame bimbo, entered the apartment earlier by the balcony, wearing the balaclava hat, poisoned madame's lunch when she was in the bedroom, stole her necklace, and left again.\n\n> Adam: Left again?\n\nBoniface: With the necklace, because it's not here. And then – this is the clever part - returned later to prove innocence. Voila the scenario!\n\nOscar: Then why would they leave the balaclava?\n\nBoniface: (DEFLATED) Ah. (BRIGHTENS) They forgot to take it with them – proving they are an amateur. Which is all of you – amateurs!\n\n> Adam: It doesn't make sense.\n\nBoniface: Why not?\n\n> Adam: Why would any one of us wish to poison a big film star like Grace, on the day of her premiere, and steal her jewellery at the same time, knowing that the whole world would then be on their tail?\n\n# Act 2\n\n(THE SAME, LATE THAT EVENING. THE ROOM IS IN DARKNESS, LIT ONLY BY MOONLIGHT FROM THE FRENCH WINDOWS. A DARK FIGURE APPEARS ON THE BALCONY. PEERS IN, RATTLES THE FRENCH WINDOWS AND ENTERS. IT IS JIMMY IN HIS DARK CLOTHES AND BALACLAVA.)\n\nJimmy: (LOW VOICE)  Hello?  Anyone here?\n\n(TAKES OFF THE BALACLAVA, GOES TO THE WASTE BIN AND PEERS IN.  LIFTS IT UP AND SHAKES IT.  IT IS EMPTY)\n\nBugger!\n\n(LOOKS AROUND THE ROOM. AT THAT MOMENT THE SUITE DOOR BURSTS OPEN AND GRACE AND ADAM ENTER, SINGING AND DOING A TANGO TOGETHER. THEY ARE PRETTY SLOSHED. THEY TANGO AROUND THE SOFA AS JIMMY FLATTENS HIMSELF AGAINST THE WALL. AS HE SIDLES TOWARDS THE SUITE DOOR OSCAR AND HAILEY BURST IN, ALSO DOING A TANGO. JIMMY IS FORCED TO RETREAT. THE TWO COUPLES CIRCLE THE ROOM IN RIOTOUS FASHION, ONE OF THEM FLICKING ON THE LIGHTS AS THEY PASS. JIMMY COWERS BACK AGAINST THE WALL)\n\nGrace: Tarararah!! What a night!\n\n> Adam: What a wonderful night!\n\nGrace: The film is a sensation – Palme d'Or here we come! Helen Mirren eat your heart out!\n\n> Adam: Meryl Streep – time to retire!\n\nHailey: Wooooo!\n\n(SHE SUDDENLY NOTICES JIMMY HIDING BY THE WALL. FRANTICALLY WAVES HIM TOWARDS THE DOOR, AT THE SAME TIME TWISTING OSCAR'S BACK TO HIM. JIMMY CREEPS TOWARDS THE OPEN DOOR)\n\nGrace: Adam, order champagne!\n\nOscar: More champagne?\n\nGrace: The night is young! The moon is bright! The stars are shining!\n\n> Adam: None brighter than yours! And mine of course.\n\nGrace: Next stop the Golden Globes!\n\nOscar: Then the Oscars!\n\n> Adam: (ON THE PHONE)  Champagne please – two bottles to Grace Gervaise's suite.\n\n(JUST AS JIMMY REACHES THE DOORWAY GRACE SEES HIM)\n\nGrace: Oh look, it's our little paparazzi man! Following us around, are you, Jimmy boy?\n\n(JIMMY IS CAUGHT IN THE DOORWAY AS IF HE HAS JUST ARRIVED.  SHE WAVES HIM IN)\n\nCome in and join the party. We're celebrating!\n\nJimmy: Er....\n\nOscar: The film is a success!\n\n> Adam: The performance of Grace's life!\n\nGrace: Yes!\n\n> Adam: And mine too of course.\n\nJimmy: (HESITATING IN THE DOORWAY)  Oh, good.\n\nGrace: There's your story, paparazzi man. Tell the world!\n\n> Adam: Write the headlines!\n\nGrace: Come in, come in! Rescue your wife from my husband's lecherous clutches.\n\nJimmy: Well, er.....\n\n(HE HIDES THE BALACLAVA BEHIND HIS BACK AND COMES BACK INTO THE ROOM)\n\nGrace: (TO ADAM)  We're going to party all night, aren't we lover?\n\n> Adam: Yes!\n\nGrace: Until the critics bring us back to earth of course.\n\nOscar: As they always do.\n\n> Adam: Stuff the critics!\n\nOscar: Bugger the critics!\n\nGrace: To hell with the lot of them! What do they know?\n\n(HAILEY IS SIGNALLING QUESTIONS TO JIMMY. HE SHAKES HIS HEAD AND GESTURES HOPELESSLY. HIDES THE BALACLAVA BEHIND A SOFA CUSHION. GRACE IS DANCING DANGEROUSLY CLOSE TO ADAM)\n\nGrace: Mmmm! The audience loved me – that's what matters.\n\n> Adam: (HIS HAND ON HER BOTTOM) They adored you!\n\nGrace: Yes!\n\n> Adam: And me of course.\nGrace: Mmmmm!\n\n> Adam: Ahhhh!\n\nOscar: Yes, well you can stop adoring each other.  Take your hands off my wife's bottom, gigolo!\n\n> Adam: Hey!\n\nGrace: You take your eyes off the bimbo's bust.\n\nHailey: (ROLLING HER EYES)  Ohhhh!\n\nGrace: Tonight is my night!  Nothing is going to spoil its glory.\n\n> Adam: Nothing!\n\nOscar: Aren't you forgetting something?\n\nGrace: What?\n\nOscar: A certain missing necklace.\n\n49\n(DEFLATING)  Oh yes.\n\n> Adam: Oh yes, that.\n\nGrace: Why did you remind me? My beautiful necklace!\n\nJimmy: You, er... still haven't found it?\n\nGrace: Of course I haven't, silly boy. I'd be wearing it, wouldn't I? (THEATRICAL) The prince will never forgive me! (WEEPS) It's a tragedy!\n\n> Adam: There now, Grace, it'll turn up.\n\nGrace: How?  Where?  It's gone for ever!  The thing I loved most in the whole world!\n\nOscar: Oh, thanks very much.\n\nGrace: It was worth ten of you, you bimbo bonker!\n\nHailey: Ohhh!\n\nOscar: That's rich coming from you – gigolo juggler!\n\n> Adam: Hey!\n\nGrace: Hot totty tippler!\n\nOscar: Smarmy stud smoocher!\n\nGrace: You're drunk!\n\nOscar: So are you!\n\nGrace: I hate you!\n\nOscar: I despise you!\n\nHailey: Hey – stop it!\n\n> Adam: Cut it out! We don't want more attempted murders – we've had one already.\n\n( ... )\n\nJimmy: I didn't think you'd want it to, er....\n\nGrace: My husband certainly wouldn't. But never mind. My wonderful film is the real story! The coup de Grace!\n(GRABS ADAM AND TWIRLS)\nTara!!!\n\n> Adam: Tara!!\n\n(HAILEY GOES TO JIMMY TO CONFER IN A CORNER, JUST AS MONSIEUR BONIFACE APPEARS IN THE DOORWAY WITH TWO BOTTLES OF CHAMPAGNE IN ICE BUCKETS)\n\nBoniface: Felicitations a tout le monde!\n\nGrace: Monsieur Boniface!\n\nBoniface: I hear the premiere is a big success! I bring you champagne myself to celebrate. Courtesy of the Hotel Superb.\n\nOscar: Well thank you!\n\n> Adam: Wonderful!\n\n(BONIFACE BRINGS THE CHAMPAGNE TO THE SIDE TABLE)\n\nBoniface: All of Cannes is talking about it. Do we have glasses? (POINTS TO THE SIDE) Yes.\n\n(OSCAR FETCHES THE GLASSES.  HAILEY ASSISTS)\nI am told madame's performance is a wonder to behold!\n\nGrace: Well of course....\n\n> Adam: And mine too.\n\n( ... )\n\nBoniface: (RAISES GLASS) The Gervaises!\n\n> All: (RAISING GLASSES)  The Gervaises!\n\n( ... )\n\nGrace: My God! Perhaps he was here when I was murdered!\n\nOscar: Almost murdered.\n\n> Adam: Perhaps he was the murderer.\n\n( ... )\n\nBoniface: Perhaps for distraction.  Perhaps to make way for the theft.  Who knows?  They say these people are extremely ruthless.\n\nOscar: My god!\n\n> Adam: That's terrible.\n\nBoniface: However – everyone here is still a suspect until the true suspects are proved guilty and the false suspects are proved innocent!\n\nOscar: Fatuous!\n\n> Adam: Preposterous!\n\n( ... )\n\nBoniface: Madame, monsieur! This is not the way for imminent show business people to behave. Especially in front of the press.\n\nJimmy: No, quite.\n\nGrace: Well it's time the press exposed my sham of a husband.\n\nOscar: And my mockery of a wife.\n\nBoniface: Please, please – these are not the kinds of stories we want in the papers. (TO ADAM) You agree, monsieur?\n\n> Adam: Absolutely.  A little discretion, please!\n\nOscar: You keep out of this! It's none of your business, you ham actor!\n\n> Adam: Ham actor!  How dare you, you... you....\n\n(AT THAT MOMENT HE GRABS HIS THROAT AND EMITS A TERRIBLE CHOKING SOUND)\n\nBoniface: Monsieur?  What is the matter?\n\n> Adam: I... I'm....\n\n(COLLAPSES ONTO THE FLOOR AND CONVULSES.)\n\n( ... )\n\nBoniface: Oh, this is a calamity!  This is a cataclysm! (ALMOST WEEPING)  My hotel will be ruined!  Nobody will ever wish to stay here again!\n\nGrace: Nonsense, Monsieur Boniface - they'll all flock to see the scene of the crime. You'll be famous!\n\n> Adam: (AT THAT MOMENT ADAM APPEARS SHAKILY IN THE BEDROOM DOORWAY) Hello everyone.  What's going on?\n\nBoniface: (STUNNED)  Monsieur!!\n\nGrace: Adam!  My lover!\n\n> Adam: I heard bangs.\n\nGrace: (RUSHING TO HIM) You're alive!\n\n> Adam: Of course I'm alive.\n\nBoniface: But you were poisoned, monsieur!\n\n> Adam: Rubbish. I just had an attack. I'm an epileptic. It happens sometimes when I'm stressed.\n\nOscar: An eciplect... a plecipept... ?\n\n> Adam: It knocks me out for a few moments, that's all. Nothing too serious.\n\nGrace: Oh, thank heavens! I thought I'd lost you.\n\n> Adam: 'Fraid not, old girl. Still here to do your next film.\n\nBoniface: But this is insane! She has killed her husband!\n\n> Adam: What?\n\nBoniface: She thought he had poisoned you.\n\n> Adam: (STARING AT OSCAR'S BODY) You killed Oscar?\n\nBoniface: She shot him.  In front of me.  In front of the paparazzi!\n\n> Adam: Oh my God, Grace!  You shot him?  What have you done??\n\nBoniface: It is the end of everything!\n\n> Adam: You'll go to prison for life!\n\nGrace: (CALMLY) Oh stop making such a drama of it. He's all right.\n\n> Adam: What?\n\nBoniface: What?\n\nGrace: (HOLDING UP THE GUN) It's the prop gun from the film. It only fires blanks. (TO OSCAR) Get up, you pansy! There's nothing wrong with you!\n\nOscar: (OSCAR STIRS AND SITS UP. EVERYONE GASPS) Oh well, that was quite fun, wasn't it?\n\n> Adam: What the...?\n\n( ... )\n\nHailey: (EVERYONE TURNS TO LOOK. SHE PASSES OUT ON THE FLOOR. THEY RUSH TO HER)\n\nBoniface: No, no, no! Not another one!\n\nGrace: Oh, the poor bimbo! What's the matter with her?\n\nOscar: She can't be epileptic too.\n\n> Adam: She's been poisoned!\n\n( ... )\n\nJimmy: Yes, but nobody's died.  We're all here. Everything's all right.\n\nHailey: You promise?\n\nJimmy: Yes, yes.\n\nOscar: This is beyond a joke!\n\n> Adam: Hear, hear.\n\n( ... )\n\nBoniface: So much so that he gives you priceless necklaces and holidays on his yacht.  What else does he love about you, eh?\n\nGrace: My vital measurements too of course.\n\nOscar: Hah!\n\n> Adam: Oh for heaven's sake you two, cut it out!\n\n( ... )\n\nGrace: I put it here I tell you! I was going to put it in its case, and then Adam distracted everyone. (TO ADAM) This is your fault!\n\n> Adam: Oh please!\n\n( ... )\n\nBoniface: (RESIGNED)  Search the room everyone!\n\n> All: (THEY ALL SEARCH THE ROOM, JIMMY AND HAILEY PRETENDING TO JOIN IN)\n\nGrace: The doors are all closed. No-one has left. It has to be here!\n\nOscar: It isn't.\n\n> Adam: Nothing.\n\n( ... )\n\nBoniface: (COLLAPSING ONTO THE SOFA)  I think I am imagining this whole day.  I think it is a reverie from which I will soon awake. (DISCOVERS THE BALACLAVA) Wait a minute. What is this? Another balaclava! (HOLDS IT UP)\n\n> Adam: It's the same one.\n\n( ... )\n\nOscar: There now, Grace, calm down. It's only jewellery.\n\nGrace: Only jewellery! It's the most beautiful thing I ever owned!\n\n> Adam: It'll turn up. We all saw it and nobody's gone out. It can't have gone far, can it Monsieur Boniface?\n\nBoniface: (SHRUGGING) They are so clever these Riviera thieves. They have such tricks. Maybe this time they somehow.... What do you think, Mr Paparazzi man?\n\nJimmy: It's a mystery.  What do you think, Hailey?\n\nHailey: It's incredible.  They've really got away with it!\n\nBoniface: What can I say?  Even I am bimboozled.\n\nGrace: (RECOVERING)  Oh well - easy come, easy go.\n\nOscar: What?\n\n> Adam: What are you saying?\n\nGrace: (OFFHAND)  It doesn't really matter.  It wasn't worth anything anyway.\n\nOscar: What do you mean?\n\nGrace: It wasn't the real necklace.  It was a replica.\n\nJimmy: What?\n\nHailey: What?\n\nGrace: I never wear the real thing – it's too valuable.\n\nBoniface: It wasn't...!  Where is the real one?\n\nGrace: In your hotel safe, Monsieur Boniface.  Where I trust it's really safe.  Unless your chef has access to it.\n\n> All: (GASPS OF INCREDULITY ALL ROUND. JIMMY AND HAILEY ROLL EYES AT EACH OTHER)\n\n( ... )\n\nGrace: Don't be such a defeatist, Monsieur Poirot of the Riviera. This cannot be insoluble. Adam, I put you in charge of investigations. Retrace everyone's movements second by second from the time you collapsed.\n\n> Adam: Why me?\n\nGrace: Because you're the only one who couldn't have taken it. You were unconscious.\n\nOscar: No! He woke up before the theft was discovered.\n\nGrace: So what? He was half ga-ga.\n\nOscar: A clever ploy.\n\nGrace: Don't be silly. Adam, carry on.\n\n> Adam: (RESIGNED)  Very well, if you say so.\n\nGrace: Start with my husband.\n\nOscar: Ludicrous!  I steal my own wife's imitation jewels?\n\nGrace: You didn't know they were imitation. I never told you because I never trusted you.\n\nOscar: Oh, thank you very much. That's....\n\nGrace: Silence!  Adam.\n\n> Adam: (UNENTHUSIASTICALLY) All right. Oscar, tell the company what you did when I collapsed?\n\n( ... )\n\nGrace: I wasn't pissed.\n\nOscar: You're still pissed now.\n\nGrace: Nonsense - I'm perfectly sober.\n\nOscar: You're never sober.  You don't know what sober means.  You....\n\n> Adam: Quiet!! Or I'll murder you both myself! (THEY RETREAT) Anyway, I don't see how he can have done it. He was on the floor half the time.\n\nGrace: All right, we'll come back to him.  What about Monsieur Boniface?\n\nBoniface: Me??\n\nGrace: When I went into the bedroom you were left alone in here with the necklace.\n\nBoniface: (SIGHING) Ah mon dieu! Now I am a jewel thief.\n\n> Adam: Well we never actually searched you, did we Monsieur Boniface?\n\n( ... )\n\nGrace: All right. Now the paparazzi man and his bimbo.\n\nHailey: Ohh!\n\nJimmy: Please stop calling my wife a bimbo.\n\nGrace: Sorry. The paparazzi man and his totty.\n\nHailey: Uh!\n\n> Adam: (TO JIMMY) Well? What were your movements?\n\nJimmy: (INDICATING OSCAR) Well, the same as his. We helped carry you in there. We didn't come back until the shots.\n\nGrace: Ah, but then what?\n\nJimmy: Well, we.... we....\n\nHailey: We watched him (ADAM) come back from the dead, and then we watched him (OSCAR) come back from the dead, and then we watched her and him (GRACE AND OSCAR) continue to try and kill each other, and then I fainted, and then we watched Monsieur Boniface quietly losing his mind.\n\nBoniface: Yes, thank you.  I haven't found it yet.\n\n> Adam: (TO GRACE) Well that hasn't proved anything. We're still no closer.\n\n( ... )\n\nGrace: I think little Jimmy and his pretty partner can tell us.\n\n(EVERYONE STARES AT THE PAIR)\n\nBoniface: Eh?\n\nOscar: What?\n\nJimmy: Us?\n\nGrace: Yes, you, you pseudo paparazzi man. You clever pair of innocents. You're no journalist. She's no secretary. You're the Riviera jewel thieves, aren't you?\n\nHailey: Us?\n\nGrace: You think you can pull the wool over my eyes? Me, the expert on every convoluted film plot ever written? The star of half the crime melodramas ever made? I rumbled you two the moment you met here.\n\nBoniface: Is this true?  You are the Riviera jewel thieves?\n\nJimmy: (BASHFUL) Well.... I suppose there's no point in denying it now.\n\nOscar: Good God!\n\n> Adam: Bloody hell!\n\n( ... )\n\nOscar: (POINTING AT ADAM)  Is he your lover, or isn't he your lover?\n\nGrace: Of course he's not my lover.\n\n> Adam: Of course I'm not her lover.\n\nOscar: How do I know that?\n\nGrace: He blows the other way, you fool!\n\nOscar: What?\n\nGrace: He's gay.  He's a poof.  Aren't you, Adam?\n\n> Adam: Yeh.\n\nOscar: You're gay?\n\n> Adam: Bent as a hairpin. But don't tell my fans.\n\n( ... )\n\nGrace: We're not really such a bad team, are we?\n\nOscar: No.  Oh, I'm relieved!  I didn't really want to lose you.\n\nGrace: Of course you didn't.  Where else would you find a prima donna like me to brighten your life?\n\n> Adam: Exactly.\n\nGrace: You'd be bored to death without me to dramatise our affairs.\n\nOscar: And you'd be lost without me to manage your affairs.\n\nGrace: Of course I would. (THEY CLASP EACH OTHER)\n\nOscar: Ahhh!\n\nGrace: Ahh!\n\n> Adam: (CLAPPING) Hurrah! All friends again.\n"}